
#Область ПрограммныйИнтерфейс

// Обработка события подписки на событие.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.РеестрФункций - Источник.
//  Отказ - Булево - Отказ.
//  Замещение - Булево - Замещение.
Процедура РегистрыСведенийПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	Для Каждого Запись Из Источник Цикл
		Запись.Автор = ПараметрыСеанса.ТекущийПользователь;
		Запись.ДатаИзменения = ТекущаяДатаСеанса();
		Запись.ДатаСоздания = Запись.ДатаИзменения;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти