///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
//////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получить последний комментарий по объекту.
// 
// Параметры:
//  Объект - СправочникСсылка.Функции
//  ДополнительныеПараметры  - Структура
// 
// Возвращаемое значение:
// Строка.
Функция ПолучитьПоследнийКомментарийПоОбъекту(Объект, ДополнительныеПараметры = Неопределено) Экспорт
	
	Результат = "";
	
	Если НЕ ЗначениеЗаполнено(Объект) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ВнутренниеОбсужденияСрезПоследних.ТекстСообщения КАК ТекстСообщения
		|ИЗ
		|	РегистрСведений.ВнутренниеОбсуждения.СрезПоследних(, Объект = &Ссылка) КАК ВнутренниеОбсужденияСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВнутренниеОбсужденияСрезПоследних.Период УБЫВ";
	Запрос.УстановитьПараметр("Ссылка", Объект);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.ТекстСообщения; // Строка
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Добавить сообщение.
// 
// Параметры:
//  СтрокаHTML - строка -
//  Текстсообщения - строка -
//  Пользователь - СправочникСсылка.Пользователи -
//  ВремяСообщения - Дата -
//  ДополнительныеПараметры  - Структура
// 
// Возвращаемое значение:
//  Строка - Добавить сообщение
Функция ДобавитьСообщение(СтрокаHTML, Текстсообщения, Пользователь, ПользовательАдресат, ВремяСообщения, Прочитано, ДополнительныеПараметры = Неопределено) Экспорт
	
	ТекущийПользователь = Пользователи.АвторизованныйПользователь();
	
	СтрокаHTML = СтрокаHTML + "<div style=""margin:0px 5px 0px 0px;"" align="
		 + ?(Пользователь = ТекущийПользователь,"right","left")
		 + "> <table border=""0"" cellpadding=""0"" cellspacing=""0"" style="" width:250px"">
		|<tbody>
		|	<tr>
		|		<td style=""background-color:#" + ?(Пользователь = ТекущийПользователь,"df8023", ?(Прочитано, "c0c0c0",
		 			?(ПользовательАдресат = Справочники.Пользователи.ПустаяСсылка() ИЛИ ПользовательАдресат = ТекущийПользователь, "f32020", "c0c0c0")))
		 + ";border-radius:15px;padding:8px""><span style=""font-size:14px"">
		|		<p>" + ?(Пользователь = ТекущийПользователь,"<font color = ""#ffffff"">", ?(Прочитано, "",
		 			?(ПользовательАдресат = Справочники.Пользователи.ПустаяСсылка() ИЛИ ПользовательАдресат = ТекущийПользователь, "<font color = ""#ffffff"">", "")))
		 + ТекстСообщения + "</td></tr>";
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтрокаHTML = СтрокаHTML + "<tr> <td style=""text-align:"
		+ ?(Пользователь = Пользователи.АвторизованныйПользователь(),"right","left")
		+ """""><span style=""font-size:10px""><em> <font color = ""#555555"">"
		+ ВремяСообщения + "  " + Пользователь
		+ "</em></td></tr></tbody></table></div>";
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СтрокаHTML;
	
КонецФункции

// Сообщения связанных согласований.
// 
// Параметры:
//  Объект - СправочникСсылка.Функции
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Сообщения связанных согласований
Функция СообщенияОбсуждения(Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сообщения.Объект КАК Объект,
		|	Сообщения.Пользователь КАК Пользователь,
		|	Сообщения.ПользовательАдресат КАК ПользовательАдресат,
		|	Сообщения.ТекстСообщения КАК ТекстСообщения,
		|	Сообщения.Прочитано КАК Прочитано,
		|	Сообщения.Период КАК Период
		|ИЗ
		|	РегистрСведений.ВнутренниеОбсуждения КАК Сообщения
		|ГДЕ
		|	Сообщения.Объект = &Объект
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	Запрос.УстановитьПараметр("Объект", Объект);
	ТаблицаСообщений = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаСообщений;
	
КонецФункции

#КонецОбласти

#КонецЕсли
