///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
//////////////////////////////////////////////////////////////////////////////////////////////////////

// BSLLS:LineLength-off в модуле постаянно указываются длинные строковые константы обработчиков,
// а их лучше записывать в одну строку

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ОбновлениеВерсииИБ

// Заполняет основные сведения о библиотеке или основной конфигурации.
// Библиотека, имя которой имя совпадает с именем конфигурации в метаданных, определяется как основная конфигурация.
// 
// Параметры:
//  Описание - Структура:
//
//   * Имя                 - Строка - имя библиотеки, например, "СтандартныеПодсистемы".
//   * Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
//   * ИдентификаторИнтернетПоддержки - Строка - уникальное имя программы в сервисах Интернет-поддержки.
//   * ТребуемыеПодсистемы - Массив из Строка - имена других библиотек (Строка), от которых зависит данная библиотека.
//                                    Обработчики обновления таких библиотек должны быть вызваны ранее
//                                    обработчиков обновления данной библиотеки.
//                                    При циклических зависимостях или, напротив, отсутствии каких-либо зависимостей,
//                                    порядок вызова обработчиков обновления определяется порядком добавления модулей
//                                    в процедуре ПриДобавленииПодсистем общего модуля
//                                    ПодсистемыКонфигурацииПереопределяемый.
//   * РежимВыполненияОтложенныхОбработчиков - Строка - "Последовательно" - отложенные обработчики обновления выполняются
//                                    последовательно в интервале от номера версии информационной базы до номера
//                                    версии конфигурации включительно или "Параллельно" - отложенный обработчик после
//                                    обработки первой порции данных передает управление следующему обработчику, а после
//                                    выполнения последнего обработчика цикл повторяется заново.
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	// Служебные функции подсистемы собраны в отдельном модуле
	РеестрФункцийСлужебный.ПриДобавленииПодсистемы(Описание);
	
КонецПроцедуры

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
// Параметры:
//  Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
// Пример:
//  Для добавления своей процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.1.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_1_0_0";
//  Обработчик.РежимВыполнения     = "Оперативно";
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура                    = "ОбновлениеИнформационнойБазыРеестрФункций.ВыполнитьНачальноеЗаполнение";
	Обработчик.РежимВыполнения              = "Оперативно";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.0.2";
	Обработчик.Процедура                    = "ОбновлениеИнформационнойБазыРеестрФункций.ВыполнитьОбработчикОбновления_1_1_0_2";
	Обработчик.НачальноеЗаполнение          = Истина;
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.0.3";
	Обработчик.Процедура                    = "ОбновлениеИнформационнойБазыРеестрФункций.ВыполнитьОбработчикОбновления_1_1_0_3";
	Обработчик.НачальноеЗаполнение          = Ложь;
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыПереопределяемый.ПередОбновлениемИнформационнойБазы
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыПереопределяемый.ПослеОбновленияИнформационнойБазы
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
		Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыПереопределяемый.ПриПодготовкеМакетаОписанияОбновлений
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
КонецПроцедуры

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Добавляет в список процедуры-обработчики перехода с другой программы (с другим именем конфигурации).
// Например, для перехода между разными, но родственными конфигурациями: базовая -> проф -> корп.
// Вызывается перед началом обновления данных ИБ.
//
// Параметры:
//  Обработчики - ТаблицаЗначений:
//    * ПредыдущееИмяКонфигурации - Строка - имя конфигурации, с которой выполняется переход;
//                                           или "*", если нужно выполнять при переходе с любой конфигурации.
//    * Процедура                 - Строка - полное имя процедуры-обработчика перехода с программы
//                                           ПредыдущееИмяКонфигурации.
//                                  Например, "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику"
//                                  Обязательно должна быть экспортной.
//
// Пример:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.ПредыдущееИмяКонфигурации  = "УправлениеТорговлей";
//  Обработчик.Процедура                  = "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику";
//
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
КонецПроцедуры

// Вызывается после выполнения всех процедур-обработчиков перехода с другой программы (с другим именем конфигурации),
// и до начала выполнения обновления данных ИБ.
//
// Параметры:
//  ПредыдущееИмяКонфигурации    - Строка - имя конфигурации до перехода.
//  ПредыдущаяВерсияКонфигурации - Строка - имя предыдущей конфигурации (до перехода).
//  Параметры                    - Структура:
//    * ВыполнитьОбновлениеСВерсии   - Булево - по умолчанию Истина. Если установить Ложь, 
//        то будут выполнена только обязательные обработчики обновления (с версией "*").
//    * ВерсияКонфигурации           - Строка - номер версии после перехода. 
//        По умолчанию, равен значению версии конфигурации в свойствах метаданных.
//        Для того чтобы выполнить, например, все обработчики обновления с версии ПредыдущаяВерсияКонфигурации, 
//        следует установить значение параметра в ПредыдущаяВерсияКонфигурации.
//        Для того чтобы выполнить вообще все обработчики обновления, установить значение "0.0.0.1".
//    * ОчиститьСведенияОПредыдущейКонфигурации - Булево - по умолчанию Истина. 
//        Для случаев когда предыдущая конфигурация совпадает по имени с подсистемой текущей конфигурации, следует
//        указать Ложь.
//
Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации,
												Знач ПредыдущаяВерсияКонфигурации,
												Параметры) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ОбновлениеВерсииИБ

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Справочники.Действия.ВыполнитьНачальноеЗаполнение();
	Справочники.ОбъектыФункций.ВыполнитьНачальноеЗаполнение();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВыполнитьОбработчикОбновления_1_1_0_2

Процедура ВыполнитьОбработчикОбновления_1_1_0_2() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВыполнитьОбработчикОбновления_1_1_0_2_УстановкаПризнакаОбработанаВЗадаче();
	
	ВыполнитьОбработчикОбновления_1_1_0_2_УстановкаПризнакаОбработанаВИнструкции();
	
	СоздатьПоставляемыеГруппыДоступа();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ВыполнитьОбработчикОбновления_1_1_0_2_УстановкаПризнакаОбработанаВЗадаче()
	
	// Задачи
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадачиУчетныхСистем.Ссылка КАК Задача,
		|	ЗадачиУчетныхСистем.Обработана КАК Обработана_Задача,
		|	ЗадачиУчетныхСистем.СтатусЗадачи.УдалитьОбработана КАК Обработана_СтатусЗадачи
		|ИЗ
		|	Справочник.ЗадачиУчетныхСистем КАК ЗадачиУчетныхСистем";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если НЕ Выборка.Обработана_Задача = Выборка.Обработана_СтатусЗадачи Тогда
				ЗадачаОбъект = Выборка.Задача.ПолучитьОбъект();
				ЗадачаОбъект.Обработана = Выборка.Обработана_СтатусЗадачи;
				ЗадачаОбъект.ОбменДанными.Загрузка = Истина;
				ЗадачаОбъект.Записать();
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьОбработчикОбновления_1_1_0_2_УстановкаПризнакаОбработанаВИнструкции()
	
	// Инструкции
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Инструкции.Ссылка КАК Инструкция,
	|	Инструкции.Обработана КАК Обработана_Инструкция,
	|	Инструкции.СтатусИнструкции.УдалитьОбработана КАК Обработана_СтатусИнструкции
	|ИЗ
	|	Справочник.Инструкции КАК Инструкции";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если НЕ Выборка.Обработана_Инструкция = Выборка.Обработана_СтатусИнструкции Тогда
				ИнструкцияОбъект = Выборка.Инструкция.ПолучитьОбъект();
				ИнструкцияОбъект.Обработана = Выборка.Обработана_СтатусИнструкции;
				ИнструкцияОбъект.ОбменДанными.Загрузка = Истина;
				ИнструкцияОбъект.Записать();
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьПоставляемыеГруппыДоступа()
	
	// Папка групп доступа
	УникальныйИдентификатор = Новый УникальныйИдентификатор("f18fed11-c04d-45df-b18d-7bae5e5b8a49");
	ПапкаГруппДоступа = Справочники.ГруппыДоступа.ПолучитьСсылку(УникальныйИдентификатор);
	Если ПапкаГруппДоступа <> Неопределено И НЕ ПапкаГруппДоступа.Пустая() И НЕ СтрНайти(ПапкаГруппДоступа, "<Объект не найден>") Тогда
		ПапкаГруппДоступаОбъект = ПапкаГруппДоступа.ПолучитьОбъект();
	Иначе
		ПапкаГруппДоступаОбъект = Справочники.ГруппыДоступа.СоздатьГруппу();
		ПапкаГруппДоступаОбъект.УстановитьСсылкуНового(ПапкаГруппДоступа);
		ПапкаГруппДоступаОбъект.Заполнить(Неопределено);
		ПапкаГруппДоступаОбъект.УстановитьНовыйКод();
	КонецЕсли;
	ПапкаГруппДоступаОбъект.Наименование = НСтр("ru = 'Группы доступа реестра функций'", ОбщегоНазначения.КодОсновногоЯзыка());
	ПапкаГруппДоступаОбъект.Записать();
	
	// Группа доступа "Просмотр (реестр функций)"
	УникальныйИдентификатор = Новый УникальныйИдентификатор("f28fed11-c04d-45df-b18d-7bae5e5b8a49");
	ГруппаДоступа = Справочники.ГруппыДоступа.ПолучитьСсылку(УникальныйИдентификатор);
	Если ГруппаДоступа <> Неопределено И НЕ ГруппаДоступа.Пустая() И НЕ СтрНайти(ГруппаДоступа, "<Объект не найден>") Тогда
		ГруппаДоступаОбъект = ГруппаДоступа.ПолучитьОбъект();
	Иначе
		ГруппаДоступаОбъект = Справочники.ГруппыДоступа.СоздатьЭлемент();
		ГруппаДоступаОбъект.УстановитьСсылкуНового(ГруппаДоступа);
		ГруппаДоступаОбъект.Заполнить(Неопределено);
		ГруппаДоступаОбъект.УстановитьНовыйКод();
	КонецЕсли;
	ГруппаДоступаОбъект.Наименование = НСтр("ru = 'Просмотр (реестр функций)'", ОбщегоНазначения.КодОсновногоЯзыка());
	ГруппаДоступаОбъект.Родитель     = ПапкаГруппДоступаОбъект.Ссылка;
	ГруппаДоступаОбъект.Профиль      = Справочники.ПрофилиГруппДоступа.НайтиПоНаименованию(НСтр("ru = 'Просмотр (реестр функций)'", ОбщегоНазначения.КодОсновногоЯзыка()), Истина);
	ГруппаДоступаОбъект.Комментарий  = НСтр("ru = 'Доступ только на просмотр данных реестра функций'", ОбщегоНазначения.КодОсновногоЯзыка());
	ГруппаДоступаОбъект.Записать();
	
	// Группа доступа "Аналитик (реестр функций)"
	УникальныйИдентификатор = Новый УникальныйИдентификатор("f38fed11-c04d-45df-b18d-7bae5e5b8a49");
	ГруппаДоступа = Справочники.ГруппыДоступа.ПолучитьСсылку(УникальныйИдентификатор);
	Если ГруппаДоступа <> Неопределено И НЕ ГруппаДоступа.Пустая() И НЕ СтрНайти(ГруппаДоступа, "<Объект не найден>") Тогда
		ГруппаДоступаОбъект = ГруппаДоступа.ПолучитьОбъект();
	Иначе
		ГруппаДоступаОбъект = Справочники.ГруппыДоступа.СоздатьЭлемент();
		ГруппаДоступаОбъект.УстановитьСсылкуНового(ГруппаДоступа);
		ГруппаДоступаОбъект.Заполнить(Неопределено);
		ГруппаДоступаОбъект.УстановитьНовыйКод();
	КонецЕсли;
	ГруппаДоступаОбъект.Наименование = НСтр("ru = 'Аналитик (реестр функций)'", ОбщегоНазначения.КодОсновногоЯзыка());
	ГруппаДоступаОбъект.Родитель     = ПапкаГруппДоступаОбъект.Ссылка;
	ГруппаДоступаОбъект.Профиль      = Справочники.ПрофилиГруппДоступа.НайтиПоНаименованию(НСтр("ru = 'Аналитик (реестр функций)'", ОбщегоНазначения.КодОсновногоЯзыка()), Истина);
	ГруппаДоступаОбъект.Комментарий  = НСтр("ru = 'Ввод и изменение функций и объектов'", ОбщегоНазначения.КодОсновногоЯзыка());
	ГруппаДоступаОбъект.Записать();
	
	// Группа доступа "Администратор (реестр функций)"
	УникальныйИдентификатор = Новый УникальныйИдентификатор("f48fed11-c04d-45df-b18d-7bae5e5b8a49");
	ГруппаДоступа = Справочники.ГруппыДоступа.ПолучитьСсылку(УникальныйИдентификатор);
	Если ГруппаДоступа <> Неопределено И НЕ ГруппаДоступа.Пустая() И НЕ СтрНайти(ГруппаДоступа, "<Объект не найден>") Тогда
		ГруппаДоступаОбъект = ГруппаДоступа.ПолучитьОбъект();
	Иначе
		ГруппаДоступаОбъект = Справочники.ГруппыДоступа.СоздатьЭлемент();
		ГруппаДоступаОбъект.УстановитьСсылкуНового(ГруппаДоступа);
		ГруппаДоступаОбъект.Заполнить(Неопределено);
		ГруппаДоступаОбъект.УстановитьНовыйКод();
	КонецЕсли;
	ГруппаДоступаОбъект.Наименование = НСтр("ru = 'Администратор (реестр функций)'", ОбщегоНазначения.КодОсновногоЯзыка());
	ГруппаДоступаОбъект.Родитель     = ПапкаГруппДоступаОбъект.Ссылка;
	ГруппаДоступаОбъект.Профиль      = Справочники.ПрофилиГруппДоступа.НайтиПоНаименованию(НСтр("ru = 'Администратор (реестр функций)'", ОбщегоНазначения.КодОсновногоЯзыка()), Истина);
	ГруппаДоступаОбъект.Комментарий  = НСтр("ru = 'Полные права на управление задачами'", ОбщегоНазначения.КодОсновногоЯзыка());
	ГруппаДоступаОбъект.Записать();
	
	// Группа доступа "Функциональный архитектор (реестр функций)"
	УникальныйИдентификатор = Новый УникальныйИдентификатор("f58fed11-c04d-45df-b18d-7bae5e5b8a49");
	ГруппаДоступа = Справочники.ГруппыДоступа.ПолучитьСсылку(УникальныйИдентификатор);
	Если ГруппаДоступа <> Неопределено И НЕ ГруппаДоступа.Пустая() И НЕ СтрНайти(ГруппаДоступа, "<Объект не найден>") Тогда
		ГруппаДоступаОбъект = ГруппаДоступа.ПолучитьОбъект();
	Иначе
		ГруппаДоступаОбъект = Справочники.ГруппыДоступа.СоздатьЭлемент();
		ГруппаДоступаОбъект.УстановитьСсылкуНового(ГруппаДоступа);
		ГруппаДоступаОбъект.Заполнить(Неопределено);
		ГруппаДоступаОбъект.УстановитьНовыйКод();
	КонецЕсли;
	ГруппаДоступаОбъект.Наименование = НСтр("ru = 'Функциональный архитектор (реестр функций)'", ОбщегоНазначения.КодОсновногоЯзыка());
	ГруппаДоступаОбъект.Родитель     = ПапкаГруппДоступаОбъект.Ссылка;
	ГруппаДоступаОбъект.Профиль      = Справочники.ПрофилиГруппДоступа.НайтиПоНаименованию(НСтр("ru = 'Функциональный архитектор (реестр функций)'", ОбщегоНазначения.КодОсновногоЯзыка()), Истина);
	ГруппаДоступаОбъект.Комментарий  = НСтр("ru = 'Управление задачами и функциональностью'", ОбщегоНазначения.КодОсновногоЯзыка());
	ГруппаДоступаОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ВыполнитьОбработчикОбновления_1_1_0_3

Процедура ВыполнитьОбработчикОбновления_1_1_0_3() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВыполнитьОбработчикОбновления_1_1_0_3_ЗаполнитьАвтораИзмененияВЗаписяхРегистра();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ВыполнитьОбработчикОбновления_1_1_0_3_ЗаполнитьАвтораИзмененияВЗаписяхРегистра()
	
	// Автор изменения в записях регистра
	НаборЗаписей = РегистрыСведений.РеестрФункций.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Если Запись.АвторИзменения.Пустая() Тогда
			Запись.АвторИзменения = Запись.Автор;
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей.ДополнительныеСвойства.Вставить("НеЗаполнятьРеквизиты");
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
