///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
//////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область РегистрацияСобытий

// Записывает в журнал бизнес-статистики сведения о событии.
//
// Параметры:
//  ИмяОперации	- Строка	- имя операции статистики, в случае отсутствия создается новое.
//  Значение	- Число		- количественное значение операции статистики.
//  Комментарий	- Строка	- произвольный комментарий.
//
Процедура РегистрацияСобытия(ИмяОперации, Значение = 1, Комментарий = "") Экспорт
	
	ИмяОперации = "Инструменты.РеестрФункций." + ИмяОперации;
	пр_ПоддержкаОтраслевыхРешений.ЗаписатьОперациюБизнесСтатистики(ИмяОперации, Значение);
	
КонецПроцедуры // РегистрацияСобытия()

#КонецОбласти

#Область Справочники

// Обработка события перед записью.
//
// Параметры:
//  Источник - СправочникОбъект.ОбъектыФункций, ПланВидовХарактеристикОбъект.СвойстваИнструкций, СправочникОбъект.СтатусыИнструкций,
//  		СправочникОбъект.ЗадачиУчетныхСистем, СправочникОбъект.Функции, ПланВидовХарактеристикОбъект.СвойстваЗадачУчетныхСистем, СправочникОбъект.Проекты,
//  		СправочникОбъект.Инструкции, СправочникОбъект.ДополнительныеСвойства, СправочникОбъект.СтатусыПроектов, СправочникОбъект.ТипыЗадач,
//  		СправочникОбъект.Действия, СправочникОбъект.Статусы, СправочникОбъект.ПриоритетыЗадач - Источник.
//  Отказ	 - Булево	 - Отказ.
//
Процедура СправочникиПередЗаписью(Источник, Отказ) Экспорт
	
	Если Источник.ЭтоГруппа И НЕ ТипЗнч(Источник) = Тип("СправочникОбъект.Функции") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.Пользователи") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Источник.ОбменДанными.Загрузка И Источник.Автор.Пустая() Тогда
		Источник.Автор = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
	Источник.ДатаИзменения = ТекущаяДатаСеанса();
	
	Если НЕ ЗначениеЗаполнено(Источник.ДатаСоздания) Тогда
		Источник.ДатаСоздания = Источник.ДатаИзменения;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область РегистрыСведений

// Обработка события перед записью.
//
// Параметры:
//  Источник	 - РегистрСведенийНаборЗаписей.ВнутренниеОбсуждения, РегистрСведенийНаборЗаписей.Инструкции, РегистрСведенийНаборЗаписей.РеестрФункций	 - Источник.
//  Отказ		 - Булево																																 - Отказ.
//  Замещение	 - Булево																																 - Замещение.
//
Процедура РегистрыСведенийПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	Если НЕ Источник.ДополнительныеСвойства.Свойство("НеЗаполнятьРеквизиты") Тогда
		
		Для Каждого Запись Из Источник Цикл
			
			Попытка
				Если ЗначениеЗаполнено(Запись.Автор) Тогда
					Запись.АвторИзменения = Пользователи.АвторизованныйПользователь();
					Запись.ДатаИзменения = ТекущаяДатаСеанса();
				Иначе
					Запись.Автор = Пользователи.АвторизованныйПользователь();
				КонецЕсли;
			Исключение
				Запись.Автор = Пользователи.АвторизованныйПользователь();
				Запись.ДатаИзменения = ТекущаяДатаСеанса();
			КонецПопытки;
			
			Если НЕ ЗначениеЗаполнено(Запись.ДатаСоздания) Тогда
				Запись.ДатаСоздания = ТекущаяДатаСеанса();
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеФункции

// Функция возвращает индекс картинки для переданного объекта метаданных
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - Переданный объект метаданных
// 
// Возвращаемое значение:
//  Число - Индекс картинки объекта.
//
Функция ПолучитьИндексКартинкиВидаОбъектаМетаданных(ОбъектМетаданных) Экспорт
	Индекс = 0;
	Если ОбщегоНазначения.ЭтоСправочник(ОбъектМетаданных) Тогда
		Индекс = 4;
	ИначеЕсли ОбщегоНазначения.ЭтоДокумент(ОбъектМетаданных) Тогда
		Индекс = 5;
	ИначеЕсли ОбщегоНазначения.ЭтоПеречисление(ОбъектМетаданных) Тогда
		Индекс = 7;
	ИначеЕсли ОбщегоНазначения.ЭтоПланОбмена(ОбъектМетаданных) Тогда
		Индекс = 10;
	ИначеЕсли ОбщегоНазначения.ЭтоПланВидовХарактеристик(ОбъектМетаданных) Тогда
		Индекс = 11;
	ИначеЕсли ОбщегоНазначения.ЭтоБизнесПроцесс(ОбъектМетаданных) Тогда
		Индекс = 18;
	ИначеЕсли ОбщегоНазначения.ЭтоЗадача(ОбъектМетаданных) Тогда
		Индекс = 19;
	ИначеЕсли ОбщегоНазначения.ЭтоПланСчетов(ОбъектМетаданных) Тогда
		Индекс = 12;
	ИначеЕсли ОбщегоНазначения.ЭтоПланВидовРасчета(ОбъектМетаданных) Тогда
		Индекс = 13;
	ИначеЕсли ОбщегоНазначения.ЭтоРегистрСведений(ОбъектМетаданных) Тогда
		Индекс = 14;
	ИначеЕсли ОбщегоНазначения.ЭтоРегистрНакопления(ОбъектМетаданных) Тогда
		Индекс = 15;
	ИначеЕсли ОбщегоНазначения.ЭтоРегистрБухгалтерии(ОбъектМетаданных) Тогда
		Индекс = 16;
	ИначеЕсли ОбщегоНазначения.ЭтоРегистрРасчета(ОбъектМетаданных) Тогда
		Индекс = 17;
	ИначеЕсли ОбщегоНазначения.ЭтоКонстанта(ОбъектМетаданных) Тогда
		Индекс = 3;
	ИначеЕсли ОбщегоНазначения.ЭтоЖурналДокументов(ОбъектМетаданных) Тогда
		Индекс = 6;
	КонецЕсли;
	
	Возврат Индекс;
КонецФункции

#КонецОбласти

#КонецОбласти
