///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2025, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
//////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Записывает в журнал бизнес-статистики сведения о событии.
//
// Параметры:
//  ИмяОперации	- Строка	- имя операции статистики, в случае отсутствия создается новое.
//  Значение	- Число		- количественное значение операции статистики.
//  Комментарий	- Строка	- произвольный комментарий.
//
Процедура РегистрацияСобытия(ИмяОперации, Значение = 1, Комментарий = "") Экспорт
	
	ИмяОперации = "Инструменты.РеестрФункций." + ИмяОперации;
	пр_ПоддержкаОтраслевыхРешений.ЗаписатьОперациюБизнесСтатистики(ИмяОперации, Значение);
	
КонецПроцедуры // РегистрацияСобытия()

#КонецОбласти
