///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
//////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РеестрФункцийСервер.РегистрацияСобытия("ЗадачиУчетныхСистем.Элемент");
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОбновитьФункцииИОбъекты(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьФункцииИОбъекты(ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьДоступностьПолей();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДругимПодрядчикомПриИзменении(Элемент)
	
	Объект.Исполнитель = Неопределено;
	НастроитьДоступностьПолей();
	
КонецПроцедуры

&НаКлиенте
Процедура КодНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПодключитьОбработчикОжидания("Подключаемый_КодНачалоВыбора", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыФункцииИОбъекты

&НаКлиенте
Процедура ФункцииИОбъектыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Копирование Тогда
		ТекущиеДанные = Элемент.ТекущиеДанные;
		ТекущиеДанные.Автор          = Неопределено;
		ТекущиеДанные.ДатаСоздания   = Неопределено;
		ТекущиеДанные.АвторИзменения = Неопределено;
		ТекущиеДанные.ДатаИзменения  = Неопределено;
		ТекущиеДанные.Создано        = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФункцииИОбъекты

&НаКлиенте
Процедура ФункцииИОбъектыФункцияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ФункцииИОбъекты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Автор) Тогда
		ТекущиеДанные.Изменено = Истина;
	Иначе
		ТекущиеДанные.Создано = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФункцииИОбъектыОбъектПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ФункцииИОбъекты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Автор) Тогда
		ТекущиеДанные.Изменено = Истина;
	Иначе
		ТекущиеДанные.Создано = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФункцииИОбъектыДействиеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ФункцииИОбъекты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Автор) Тогда
		ТекущиеДанные.Изменено = Истина;
	Иначе
		ТекущиеДанные.Создано = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФункцииИОбъектыОбъектАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если НЕ ПустаяСтрока(Текст) Тогда
		
		СтандартнаяОбработка = Ложь;
	
		ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.ОбъектыФункций"), ПараметрыПолученияДанных);
	
		Для Каждого ЭлементДанныхВыбора Из ДанныеВыбора Цикл
			ЭлементДанныхВыбора.Представление = Новый ФорматированнаяСтрока(Строка(ЭлементДанныхВыбора.Значение));
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФункцииИОбъектыФункцияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если НЕ ПустаяСтрока(Текст) Тогда
		
		СтандартнаяОбработка = Ложь;
	
		ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.Функции"), ПараметрыПолученияДанных);
	
		Для Каждого ЭлементДанныхВыбора Из ДанныеВыбора Цикл
			ЭлементДанныхВыбора.Представление = Новый ФорматированнаяСтрока(Строка(ЭлементДанныхВыбора.Значение));
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодборОбъектовРеестра(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("МножественныйВыбор", Истина);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"Подключаемый_ОбработкаРезультатаОповещения", ЭтотОбъект, "ПодборОбъектовРеестра");
	
	ОткрытьФорму(
		"Справочник.ОбъектыФункций.ФормаВыбора",
		ПараметрыОткрытия,
		ЭтотОбъект, , , ,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСсылку(Команда)
	
	Если ЗначениеЗаполнено(Объект.СсылкаНаЗадачу) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", ЭтотОбъект, "ОткрытиеСсылки");
		НачатьЗапускПриложения(ОписаниеОповещения, Объект.СсылкаНаЗадачу);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьАвторов(Команда)
	
	Элементы.ФункцииИОбъектыПоказатьАвторов.Пометка = НЕ Элементы.ФункцииИОбъектыПоказатьАвторов.Пометка;
	
	Если Элементы.ФункцииИОбъектыПоказатьАвторов.Пометка Тогда
		Элементы.ФункцииИОбъектыДатаСоздания.Видимость    = Истина;
		Элементы.ФункцииИОбъектыАвторИзменения.Видимость  = Истина;
		Элементы.ФункцииИОбъектыДатаИзменения.Видимость   = Истина;
		Элементы.ФункцииИОбъектыАвтор.Видимость           = Истина;
		Элементы.ФункцииИОбъектыПоказатьАвторов.Заголовок = НСтр("ru = 'Скрыть авторов'");
	Иначе
		Элементы.ФункцииИОбъектыДатаСоздания.Видимость    = Ложь;
		Элементы.ФункцииИОбъектыАвторИзменения.Видимость  = Ложь;
		Элементы.ФункцииИОбъектыДатаИзменения.Видимость   = Ложь;
		Элементы.ФункцииИОбъектыАвтор.Видимость           = Ложь;
		Элементы.ФункцииИОбъектыПоказатьАвторов.Заголовок = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСлужебногоПрограммногоИнтерфейса

// Подключаемый обработка результата оповещения.
// 
// Параметры:
//  РезультатОповещения - Массив из СправочникСсылка.ОбъектыФункций
//  ДополнительныеПараметры - Неопределено - Дополнительные параметры
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ДополнительныеПараметры = "ПодборОбъектовРеестра" Тогда
		Если НЕ РезультатОповещения = Неопределено И РезультатОповещения.Количество() Тогда
			Для Каждого ЭлементРезультатаОповещения Из РезультатОповещения Цикл
				НоваяСтрока = ФункцииИОбъекты.Добавить();
				НоваяСтрока.ОбъектРеестра = ЭлементРезультатаОповещения;
				НоваяСтрока.Создано = Истина;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если ДополнительныеПараметры = "ОткрытиеСсылки" Тогда
		// Зарезервировано
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КодНачалоВыбора() Экспорт
	
	КодНачалоВыбораНаСервере();
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ОбновитьФункцииИОбъекты(ТекущийОбъект)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеестрФункций.ОбъектРеестра КАК ОбъектРеестра,
		|	РеестрФункций.ФункцияРеестра КАК ФункцияРеестра,
		|	РеестрФункций.Действие КАК Действие,
		|	РеестрФункций.Автор КАК Автор,
		|	РеестрФункций.ДатаСоздания КАК ДатаСоздания,
		|	РеестрФункций.АвторИзменения КАК АвторИзменения,
		|	РеестрФункций.ДатаИзменения КАК ДатаИзменения
		|ИЗ
		|	РегистрСведений.РеестрФункций КАК РеестрФункций
		|ГДЕ
		|	РеестрФункций.ЗадачаРеестра = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеестрФункций.ФункцияРеестра.Наименование,
		|	РеестрФункций.ОбъектРеестра.Наименование,
		|	РеестрФункций.Действие.Символ";
	Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Ссылка);
	ТаблицаФункцийИОбъектов = Запрос.Выполнить().Выгрузить();
	
	ФункцииИОбъекты.Загрузить(ТаблицаФункцийИОбъектов);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьФункцииИОбъекты(ТекущийОбъект)
	
	НаборЗаписей = РегистрыСведений.РеестрФункций.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЗадачаРеестра.Установить(ТекущийОбъект.Ссылка);
	
	ТаблицаФункцийИОбъектов = ФункцииИОбъекты.Выгрузить();
	ТаблицаФункцийИОбъектов.Колонки.Добавить("ЗадачаРеестра");
	ТаблицаФункцийИОбъектов.ЗаполнитьЗначения(ТекущийОбъект.Ссылка, "ЗадачаРеестра");
	
	ТекущийПользователь = Пользователи.АвторизованныйПользователь();
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	Для Каждого Строка Из ТаблицаФункцийИОбъектов Цикл
		Если Строка.Создано Тогда
			Строка.Автор          = ТекущийПользователь;
			Строка.ДатаСоздания   = ТекущаяДатаСеанса;
			Строка.Создано        = Ложь;
		ИначеЕсли Строка.Изменено Тогда
			Строка.АвторИзменения = ТекущийПользователь;
			Строка.ДатаИзменения  = ТекущаяДатаСеанса;
			Строка.Изменено       = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей.ДополнительныеСвойства.Вставить("НеЗаполнятьРеквизиты");
	НаборЗаписей.Загрузить(ТаблицаФункцийИОбъектов);
	
	НаборЗаписей.Записать(Истина);
	
	ФункцииИОбъекты.Загрузить(ТаблицаФункцийИОбъектов);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступностьПолей()
	
	Элементы.Исполнитель.ТолькоПросмотр = Объект.ДругимПодрядчиком;
	
КонецПроцедуры

&НаСервере
Процедура КодНачалоВыбораНаСервере()
	
	ОбъектЗадача = РеквизитФормыВЗначение("Объект");
	ОбъектЗадача.УстановитьНовыйКод();
	Объект.Код = СокрЛП(ОбъектЗадача.Код);
	
КонецПроцедуры

#КонецОбласти
