
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РеестрФункцийСервер.РегистрацияСобытия("ЗадачиУчетныхСистем.Элемент");
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОбновитьФункцииИОбъекты(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьФункцииИОбъекты(ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьДоступностьПолей();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДругимПодрядчикомПриИзменении(Элемент)
	
	Объект.Исполнитель = Неопределено;
	НастроитьДоступностьПолей();
	
КонецПроцедуры

&НаКлиенте
Процедура КодНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПодключитьОбработчикОжидания("Подключаемый_КодНачалоВыбора", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФункцииИОбъекты

&НаКлиенте
Процедура ФункцииИОбъектыОбъектАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если НЕ ПустаяСтрока(Текст) Тогда
		
		СтандартнаяОбработка = Ложь;
	
		ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.ОбъектыФункций"), ПараметрыПолученияДанных);
	
		Для Каждого ЭлементДанныхВыбора Из ДанныеВыбора Цикл
			ЭлементДанныхВыбора.Представление = Новый ФорматированнаяСтрока(Строка(ЭлементДанныхВыбора.Значение));
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФункцииИОбъектыФункцияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если НЕ ПустаяСтрока(Текст) Тогда
		
		СтандартнаяОбработка = Ложь;
	
		ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.Функции"), ПараметрыПолученияДанных);
	
		Для Каждого ЭлементДанныхВыбора Из ДанныеВыбора Цикл
			ЭлементДанныхВыбора.Представление = Новый ФорматированнаяСтрока(Строка(ЭлементДанныхВыбора.Значение));
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодборОбъектовРеестра(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("МножественныйВыбор", Истина);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"Подключаемый_ОбработкаРезультатаОповещения", ЭтотОбъект, "ПодборОбъектовРеестра");
	
	ОткрытьФорму(
		"Справочник.ОбъектыФункций.ФормаВыбора",
		ПараметрыОткрытия,
		ЭтотОбъект, , , ,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСсылку(Команда)
	
	Если ЗначениеЗаполнено(Объект.СсылкаНаЗадачу) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", ЭтотОбъект, "ОткрытиеСсылки");
		НачатьЗапускПриложения(ОписаниеОповещения, Объект.СсылкаНаЗадачу);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСлужебногоПрограммногоИнтерфейса

// Подключаемый обработка результата оповещения.
// 
// Параметры:
//  РезультатОповещения - Массив из СправочникСсылка.ОбъектыФункций
//  ДополнительныеПараметры - Неопределено - Дополнительные параметры
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ДополнительныеПараметры = "ПодборОбъектовРеестра" Тогда
		Если НЕ РезультатОповещения = Неопределено И РезультатОповещения.Количество() Тогда
			Для Каждого ЭлементРезультатаОповещения Из РезультатОповещения Цикл
				НоваяСтрока = ФункцииИОбъекты.Добавить();
				НоваяСтрока.ОбъектРеестра = ЭлементРезультатаОповещения;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если ДополнительныеПараметры = "ОткрытиеСсылки" Тогда
		// Зарезервировано
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КодНачалоВыбора() Экспорт
	
	КодНачалоВыбораНаСервере();
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ОбновитьФункцииИОбъекты(ТекущийОбъект)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеестрФункций.ОбъектРеестра КАК ОбъектРеестра,
		|	РеестрФункций.ФункцияРеестра КАК ФункцияРеестра,
		|	РеестрФункций.Действие КАК Действие
		|ИЗ
		|	РегистрСведений.РеестрФункций КАК РеестрФункций
		|ГДЕ
		|	РеестрФункций.ЗадачаРеестра = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеестрФункций.ФункцияРеестра.Наименование,
		|	РеестрФункций.ОбъектРеестра.Наименование,
		|	РеестрФункций.Действие.Символ";
	Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Ссылка);
	ТаблицаФункцийИОбъектов = Запрос.Выполнить().Выгрузить();
	
	ФункцииИОбъекты.Загрузить(ТаблицаФункцийИОбъектов);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьФункцииИОбъекты(ТекущийОбъект)
	
	НаборЗаписей = РегистрыСведений.РеестрФункций.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЗадачаРеестра.Установить(ТекущийОбъект.Ссылка);
	
	ТаблицаФункцийИОбъектов = ФункцииИОбъекты.Выгрузить();
	ТаблицаФункцийИОбъектов.Колонки.Добавить("ЗадачаРеестра");
	ТаблицаФункцийИОбъектов.ЗаполнитьЗначения(ТекущийОбъект.Ссылка, "ЗадачаРеестра");
	
	НаборЗаписей.Загрузить(ТаблицаФункцийИОбъектов);
	
	НаборЗаписей.Записать(Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступностьПолей()
	
	Элементы.Исполнитель.ТолькоПросмотр = Объект.ДругимПодрядчиком;
	
КонецПроцедуры

&НаСервере
Процедура КодНачалоВыбораНаСервере()
	
	ОбъектЗадача = РеквизитФормыВЗначение("Объект");
	ОбъектЗадача.УстановитьНовыйКод();
	Объект.Код = СокрЛП(ОбъектЗадача.Код);
	
КонецПроцедуры

#КонецОбласти
