
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	Если ЗначениеЗаполнено(Проект) Тогда
		Префикс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Проект, "Код");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Проект) Тогда
		Проект = Константы.ПроектПоУмолчанию.Получить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ (Проект.Пустая() ИЛИ ПустаяСтрока(Наименование)) И ЭтоГруппа И ПустаяСтрока(Код) Тогда
		УстановитьНовыйКод();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
