
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РеестрФункцийСервер.РегистрацияСобытия("Проекты.Элемент");
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПоУмолчанию = (ТекущийОбъект.Ссылка = Константы.ПроектПоУмолчанию.Получить());
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БылПоУмолчанию = (ТекущийОбъект.Ссылка = Константы.ПроектПоУмолчанию.Получить());
	Если БылПоУмолчанию И НЕ ПоУмолчанию Тогда
		Константы.ПроектПоУмолчанию.Установить(Справочники.Проекты.ПустаяСсылка());
	ИначеЕсли ПоУмолчанию Тогда
		Константы.ПроектПоУмолчанию.Установить(ТекущийОбъект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСписок

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСлужебногоПрограммногоИнтерфейса

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииКлиент

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииСервер

#КонецОбласти

#КонецОбласти
