///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
//////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РеестрФункцийСервер.РегистрацияСобытия("Проекты.Элемент");
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПоУмолчанию = (ТекущийОбъект.Ссылка = Константы.ПроектПоУмолчанию.Получить());
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БылПоУмолчанию = (ТекущийОбъект.Ссылка = Константы.ПроектПоУмолчанию.Получить());
	Если БылПоУмолчанию И НЕ ПоУмолчанию Тогда
		Константы.ПроектПоУмолчанию.Установить(Справочники.Проекты.ПустаяСсылка());
	ИначеЕсли ПоУмолчанию Тогда
		Константы.ПроектПоУмолчанию.Установить(ТекущийОбъект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
