
#Область ПрограммныйИнтерфейс

// Функция возвращает индекс картинки для переданного объекта метаданных
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - Переданный объект метаданных
// 
// Возвращаемое значение:
//  Число - Индекс картинки объекта.
//
Функция ПолучитьИндексКартинкиВидаОбъектаМетаданных(ОбъектМетаданных) Экспорт
	Индекс = 0;
	Если ОбщегоНазначения.ЭтоСправочник(ОбъектМетаданных) Тогда
		Индекс = 4;
	ИначеЕсли ОбщегоНазначения.ЭтоДокумент(ОбъектМетаданных) Тогда
		Индекс = 5;
	ИначеЕсли ОбщегоНазначения.ЭтоПеречисление(ОбъектМетаданных) Тогда
		Индекс = 7;
	ИначеЕсли ОбщегоНазначения.ЭтоПланОбмена(ОбъектМетаданных) Тогда
		Индекс = 10;
	ИначеЕсли ОбщегоНазначения.ЭтоПланВидовХарактеристик(ОбъектМетаданных) Тогда
		Индекс = 11;
	ИначеЕсли ОбщегоНазначения.ЭтоБизнесПроцесс(ОбъектМетаданных) Тогда
		Индекс = 18;
	ИначеЕсли ОбщегоНазначения.ЭтоЗадача(ОбъектМетаданных) Тогда
		Индекс = 19;
	ИначеЕсли ОбщегоНазначения.ЭтоПланСчетов(ОбъектМетаданных) Тогда
		Индекс = 12;
	ИначеЕсли ОбщегоНазначения.ЭтоПланВидовРасчета(ОбъектМетаданных) Тогда
		Индекс = 13;
	ИначеЕсли ОбщегоНазначения.ЭтоРегистрСведений(ОбъектМетаданных) Тогда
		Индекс = 14;
	ИначеЕсли ОбщегоНазначения.ЭтоРегистрНакопления(ОбъектМетаданных) Тогда
		Индекс = 15;
	ИначеЕсли ОбщегоНазначения.ЭтоРегистрБухгалтерии(ОбъектМетаданных) Тогда
		Индекс = 16;
	ИначеЕсли ОбщегоНазначения.ЭтоРегистрРасчета(ОбъектМетаданных) Тогда
		Индекс = 17;
	ИначеЕсли ОбщегоНазначения.ЭтоКонстанта(ОбъектМетаданных) Тогда
		Индекс = 3;
	ИначеЕсли ОбщегоНазначения.ЭтоЖурналДокументов(ОбъектМетаданных) Тогда
		Индекс = 6;
	КонецЕсли;
	
	Возврат Индекс;
КонецФункции

#КонецОбласти

