///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
//////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РеестрФункцийСервер.РегистрацияСобытия("Функции.Элемент");
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОбновитьЧатНаСервере();
	
	СтруктураВложений = ТекущийОбъект.СодержаниеHTML_Картинки.Получить();
	Если СтруктураВложений = Неопределено Тогда
		СтруктураВложений = Новый Структура;
	КонецЕсли;
	СодержаниеФорматированныйДокумент.УстановитьHTML(ТекущийОбъект.СодержаниеHTML, СтруктураВложений);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СтруктураВложений = Новый Структура;
	СодержаниеФорматированныйДокумент.ПолучитьHTML(ТекущийОбъект.СодержаниеHTML, СтруктураВложений);
	ТекущийОбъект.СодержаниеHTML_Картинки = Новый ХранилищеЗначения(СтруктураВложений);
	ТекущийОбъект.Содержание = СодержаниеФорматированныйДокумент.ПолучитьТекст();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьЧатНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПользовательАдресатПриИзменении(Элемент)
	
	ПользовательАдресатПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьСообщение(Команда)
	
	ТекстСообщения = СокрЛП(ТекстСообщения);
	
	Если ПустаяСтрока(ТекстСообщения) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() И НЕ Записать() Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьСообщениеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЧат(Команда)
	
	ОбновитьЧатНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусПрочитано(Команда)
	
	УстановитьСтатусПрочитаноНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СлужебныеПроцедурыИФункцииСервер

&НаСервере
Процедура ДобавитьСообщениеНаСервере()
	
	НоваяЗапись = РегистрыСведений.ВнутренниеОбсуждения.СоздатьМенеджерЗаписи();
	НоваяЗапись.Период = ТекущаяДатаСеанса();
	НоваяЗапись.Объект = Объект.Ссылка;
	НоваяЗапись.Пользователь = Пользователи.АвторизованныйПользователь();
	НоваяЗапись.ТекстСообщения = ТекстСообщения;
	НоваяЗапись.ПользовательАдресат = ПользовательАдресат;
	
	НоваяЗапись.Записать(Истина);
	
	ТекстСообщения = "";
	ПользовательАдресат = Неопределено;
	
	ОбновитьЧатНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЧатНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСообщений = РегистрыСведений.ВнутренниеОбсуждения.СообщенияОбсуждения(Объект.Ссылка);
	
	СтрокаHTML = "<HTML><BODY style=""background-color:#ecf0f3"">";		
	
	Если ТаблицаСообщений.Количество() Тогда
		Для Каждого СтрокаТЗ Из ТаблицаСообщений Цикл
			СтрокаHTML = РегистрыСведений.ВнутренниеОбсуждения.ДобавитьСообщение(
				СтрокаHTML,
				СтрокаТЗ.ТекстСообщения,
				СтрокаТЗ.Пользователь,
				СтрокаТЗ.ПользовательАдресат,
				СтрокаТЗ.Период,
				СтрокаТЗ.Прочитано);
			СтрокаHTML = СтрокаHTML + "<p></p>";
		КонецЦикла;
		Элементы.ЯПрочиталАдресованныеМнеСообщения.Видимость = ЕстьНепрочитанныеСообщения();
		Если Элементы.ЯПрочиталАдресованныеМнеСообщения.Видимость Тогда
			Элементы.СтраницаСообщенияПользователей.ЦветФона = ЦветаСтиля.ЦветФонаВнимание;
		Иначе
			Элементы.СтраницаСообщенияПользователей.ЦветФона = Новый Цвет;
		КонецЕсли;
	Иначе
		СтрокаHTML = СтрокаHTML + "<div align=center> <table border=""0"" cellpadding=""0"" cellspacing=""0"" style="" width:250px"">
			|<tbody>
			|	<tr>
			|		<td style=""background-color:#c0c0c0;border-radius:15px;padding:5px""><span style=""font-size:14px"">
			|		<p align=center>Внутреннее обсуждение не начато</p></span></td>
			|</tr></tbody></table></div>";
		Элементы.ЯПрочиталАдресованныеМнеСообщения.Видимость = Ложь;
		Элементы.СтраницаСообщенияПользователей.ЦветФона = Новый Цвет;
	КонецЕсли;
	
	СтрокаHTML = СтрокаHTML + "</body></html>";
	
	ПолеHTML = СтрокаHTML;
	
КонецПроцедуры

&НаСервере
Функция ЕстьНепрочитанныеСообщения()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВнутренниеОбсуждения.Период КАК Период,
		|	ВнутренниеОбсуждения.Объект КАК Объект,
		|	ВнутренниеОбсуждения.Пользователь КАК Пользователь,
		|	ВнутренниеОбсуждения.ТекстСообщения КАК ТекстСообщения
		|ИЗ
		|	РегистрСведений.ВнутренниеОбсуждения КАК ВнутренниеОбсуждения
		|ГДЕ
		|	НЕ ВнутренниеОбсуждения.Прочитано
		|	И ВнутренниеОбсуждения.Объект = &Объект
		|	И НЕ ВнутренниеОбсуждения.Пользователь = &Пользователь
		|	И (ВнутренниеОбсуждения.ПользовательАдресат = &Пользователь
		|			ИЛИ ВнутренниеОбсуждения.ПользовательАдресат = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))";
	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь());
	Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

&НаСервере
Процедура УстановитьСтатусПрочитаноНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВнутренниеОбсуждения.Период КАК Период,
		|	ВнутренниеОбсуждения.Объект КАК Объект,
		|	ВнутренниеОбсуждения.Пользователь КАК Пользователь,
		|	ВнутренниеОбсуждения.ПользовательАдресат КАК ПользовательАдресат,
		|	ВнутренниеОбсуждения.ТекстСообщения КАК ТекстСообщения
		|ИЗ
		|	РегистрСведений.ВнутренниеОбсуждения КАК ВнутренниеОбсуждения
		|ГДЕ
		|	НЕ ВнутренниеОбсуждения.Прочитано
		|	И ВнутренниеОбсуждения.Объект = &Объект
		|	И НЕ ВнутренниеОбсуждения.Пользователь = &Пользователь
		|	И (ВнутренниеОбсуждения.ПользовательАдресат = &Пользователь
		|			ИЛИ ВнутренниеОбсуждения.ПользовательАдресат = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))";
	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь());
	Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяЗапись = РегистрыСведений.ВнутренниеОбсуждения.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		НоваяЗапись.Прочитано = Истина;
		
		НоваяЗапись.Записать(Истина);
		
	КонецЦикла;
	
	ОбновитьЧатНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПользовательАдресатПриИзмененииНаСервере()
	
	Если ПользовательАдресат = Пользователи.АвторизованныйПользователь() Тогда
		ПользовательАдресат = Неопределено;
		Текст = НСтр("ru = 'Запрещено отправлять сообщения своему пользователю'");
		ОбщегоНазначения.СообщитьПользователю(Текст);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
