
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РеестрФункцийСервер.РегистрацияСобытия("Функции.Элемент");
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОбновитьЧатНаСервере();
	
	СтруктураВложений = ТекущийОбъект.СодержаниеHTML_Картинки.Получить();
	Если СтруктураВложений = Неопределено Тогда
		СтруктураВложений = Новый Структура;
	КонецЕсли;
	СодержаниеФорматированныйДокумент.УстановитьHTML(ТекущийОбъект.СодержаниеHTML, СтруктураВложений);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СтруктураВложений = Новый Структура;
	СодержаниеФорматированныйДокумент.ПолучитьHTML(ТекущийОбъект.СодержаниеHTML, СтруктураВложений);
	ТекущийОбъект.СодержаниеHTML_Картинки = Новый ХранилищеЗначения(СтруктураВложений);
	ТекущийОбъект.Содержание = СодержаниеФорматированныйДокумент.ПолучитьТекст();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьЧатНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьСообщение(Команда)
	
	ТекстСообщения = СокрЛП(ТекстСообщения);
	
	Если ПустаяСтрока(ТекстСообщения) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() И НЕ Записать() Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьСообщениеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЧат(Команда)
	
	ОбновитьЧатНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СлужебныеПроцедурыИФункцииСервер

&НаСервере
Процедура ДобавитьСообщениеНаСервере()
	
	НоваяЗапись = РегистрыСведений.ВнутренниеОбсуждения.СоздатьМенеджерЗаписи();
	НоваяЗапись.Период = ТекущаяДатаСеанса();
	НоваяЗапись.Объект = Объект.Ссылка;
	НоваяЗапись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	НоваяЗапись.ТекстСообщения = ТекстСообщения;
	
	НоваяЗапись.Записать(Истина);
	
	ТекстСообщения = "";
	
	ОбновитьЧатНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЧатНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСообщений = РегистрыСведений.ВнутренниеОбсуждения.СообщенияОбсуждения(Объект.Ссылка);
	
	СтрокаHTML = "<HTML><BODY style=""background-color:#ecf0f3"">";		
	
	Если ТаблицаСообщений.Количество() Тогда
		Для Каждого СтрокаТЗ Из ТаблицаСообщений Цикл
			СтрокаHTML = РегистрыСведений.ВнутренниеОбсуждения.ДобавитьСообщение(
				СтрокаHTML,
				СтрокаТЗ.ТекстСообщения,
				СтрокаТЗ.Пользователь,
				СтрокаТЗ.Период);
			СтрокаHTML = СтрокаHTML + "<p></p>";
		КонецЦикла;
	Иначе
		СтрокаHTML = СтрокаHTML + "<div align=center> <table border=""0"" cellpadding=""0"" cellspacing=""0"" style="" width:250px"">
			|<tbody>
			|	<tr>
			|		<td style=""background-color:#c0c0c0;border-radius:15px;padding:5px""><span style=""font-size:14px"">
			|		<p align=center>Внутреннее обсуждение не начато</p></span></td>
			|</tr></tbody></table></div>";
	КонецЕсли;
	
	СтрокаHTML = СтрокаHTML + "</body></html>";
	
	ПолеHTML = СтрокаHTML;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
