///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
//////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Производит инициализацию элементов справочника.
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	
	ДоступИзмененОбъект = ДоступИзменен.ПолучитьОбъект();
	ДоступИзмененОбъект.Символ = Лев(ДоступИзмененОбъект.Наименование, 1);
	ДоступИзмененОбъект.Записать();
	
	ИзмененОбъект = Изменен.ПолучитьОбъект();
	ИзмененОбъект.Символ = Лев(ИзмененОбъект.Наименование, 1);
	ИзмененОбъект.Записать();
	
	СозданОбъект = Создан.ПолучитьОбъект();
	СозданОбъект.Символ = Лев(СозданОбъект.Наименование, 1);
	СозданОбъект.Записать();
	
	УдаленОбъект = Удален.ПолучитьОбъект();
	УдаленОбъект.Символ = Лев(УдаленОбъект.Наименование, 1);
	УдаленОбъект.Записать();
	
КонецПроцедуры // ВыполнитьНачальноеЗаполнение()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПараметрыОбработкиРеквизитовОбъекта

Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура;
	УникальныеРеквизиты.Вставить("Наименование");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

#КонецОбласти

#КонецОбласти

#КонецЕсли
