
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьТаблицыОтборов();

	ОтображениеСостояния = Элементы.ТабличноеПолеОтчета.ОтображениеСостояния;
	ОтображениеСостояния.Видимость                      = Истина;
	ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
	ОтображениеСостояния.Картинка                       = БиблиотекаКартинок.ДиалогВосклицание;
	ОтображениеСостояния.Текст                          =
		"Для формирования отчета нажмите кнопку обновления в контекстном меню табличного документа или в панели настроек";
	
	ОбновитьСписокОшибок();
	
	ОтборПроект = Константы.ПроектПоУмолчанию.Получить();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)

	Если Настройки = Неопределено Тогда
		Элементы.СтраницыРеестрФункций.ТекущаяСтраница = Элементы.СтраницаОтчет;
		Элементы.РежимОтчет.Пометка = Истина;
		Возврат;
	КонецЕсли;

	СоответствиеДоступныхОтборов = ПолучитьСоответствиеДоступныхОтборов();

	Для Каждого ДоступныйОтбор Из СоответствиеДоступныхОтборов Цикл
		ИспользованиеОтбора = Настройки.Получить("Использовать" + ДоступныйОтбор.Ключ); // Булево
		Если Не ИспользованиеОтбора = Неопределено Тогда
			Элементы[ДоступныйОтбор.Ключ].Видимость = ИспользованиеОтбора;
			Элементы[ДоступныйОтбор.Ключ + "1"].Видимость = ИспользованиеОтбора;
			Элементы[ДоступныйОтбор.Ключ + "Группа"].Видимость = ИспользованиеОтбора;
		КонецЕсли;
	КонецЦикла;

	Элементы.ОбновитьСпискиОтборов.Видимость = ИспользоватьОтборАвтор Или ИспользоватьОтборДействие Или ИспользоватьОтборЗадача
		Или ИспользоватьОтборОбъект Или ИспользоватьОтборСтатус Или ИспользоватьОтборФункция;

	СтруктураОтборов = ПолучитьОтборыИзПанелиНастроекНаСервере();
	ОбновитьСписокРегистраСведенийНаСервере(СтруктураОтборов);

	Если РежимОтображения = 0 Тогда
		Элементы.СтраницыРеестрФункций.ТекущаяСтраница = Элементы.СтраницаОтчет;
		Элементы.РежимОтчет.Пометка = Истина;
	Иначе
		Элементы.СтраницыРеестрФункций.ТекущаяСтраница = Элементы.СтраницаРегистрСведений;
		Элементы.РежимРегистр.Пометка = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьОтборАвторПриИзменении(Элемент)

	ВключитьВыключитьОтборы(Элемент.Имя);

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборДействиеПриИзменении(Элемент)

	ВключитьВыключитьОтборы(Элемент.Имя);

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборЗадачаПриИзменении(Элемент)

	ВключитьВыключитьОтборы(Элемент.Имя);

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборОбъектПриИзменении(Элемент)

	ВключитьВыключитьОтборы(Элемент.Имя);

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборСтатусПриИзменении(Элемент)

	ВключитьВыключитьОтборы(Элемент.Имя);

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборФункцияПриИзменении(Элемент)

	ВключитьВыключитьОтборы(Элемент.Имя);

КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеОтчетаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)

	СтандартнаяОбработка = Ложь;

	ЗначениеПоля = ПолучитьЗначениеПоляРасшифровки(Расшифровка);

	Если ТипЗнч(ЗначениеПоля) = Тип("Структура") Тогда
		Если ЗначениеЗаполнено(ЗначениеПоля.Символ) Тогда
			ПараметрыОткрытия = Новый Структура("Ключ", ЗначениеПоля.Ключ);
		Иначе
			ПараметрыОткрытия = Новый Структура("ЗначенияЗаполнения", ЗначениеПоля.СтруктураПоля);
		КонецЕсли;
		ОписаниеОповещения = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", ЭтотОбъект);
		ОткрытьФорму(
			"РегистрСведений.РеестрФункций.ФормаЗаписи",
			ПараметрыОткрытия,
			ЭтотОбъект,
			УникальныйИдентификатор, , ,
			ОписаниеОповещения,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли ЗначениеЗаполнено(ЗначениеПоля) Тогда
		ПоказатьЗначение( , ЗначениеПоля);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтборЗадача

&НаКлиенте
Процедура ОтборЗадачаИспользованиеПриИзменении(Элемент)

	ИспользованиеИзменение();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтборЗадача1

&НаКлиенте
Процедура ОтборЗадачаИспользование1ПриИзменении(Элемент)

	ИспользованиеИзменениеБезЗаменыИмени();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтборОбъект

&НаКлиенте
Процедура ОтборОбъектИспользованиеПриИзменении(Элемент)

	ИспользованиеИзменение();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтборОбъект1

&НаКлиенте
Процедура ОтборОбъектИспользование1ПриИзменении(Элемент)

	ИспользованиеИзменениеБезЗаменыИмени();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтборФункция

&НаКлиенте
Процедура ОтборФункцияИспользованиеПриИзменении(Элемент)

	ИспользованиеИзменение();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтборФункция1

&НаКлиенте
Процедура ОтборФункцияИспользование1ПриИзменении(Элемент)

	ИспользованиеИзменениеБезЗаменыИмени();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтборСтатус

&НаКлиенте
Процедура ОтборСтатусИспользованиеПриИзменении(Элемент)

	ИспользованиеИзменение();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтборСтатус1

&НаКлиенте
Процедура ОтборСтатусИспользование1ПриИзменении(Элемент)

	ИспользованиеИзменениеБезЗаменыИмени();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтборАвтор

&НаКлиенте
Процедура ОтборАвторИспользованиеПриИзменении(Элемент)

	ИспользованиеИзменение();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтборАвтор1

&НаКлиенте
Процедура ОтборАвторИспользование1ПриИзменении(Элемент)

	ИспользованиеИзменениеБезЗаменыИмени();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтборДействие

&НаКлиенте
Процедура ОтборДействиеИспользованиеПриИзменении(Элемент)

	ИспользованиеИзменение();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтборДействие1

&НаКлиенте
Процедура ОтборДействиеИспользование1ПриИзменении(Элемент)

	ИспользованиеИзменениеБезЗаменыИмени();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СвернутьДерево(Команда)

	ТекущийЭлементИмя = ПолучитьИмяТекущегоЭлементаФормыСЗаменой();
	
	ТекущееДеревоЗначений = ЭтотОбъект[ТекущийЭлементИмя]; // ДанныеФормыДерево
	ЭлементыКорняДерева = ТекущееДеревоЗначений.ПолучитьЭлементы();
	Для Каждого ЭлементКорняДерева Из ЭлементыКорняДерева Цикл
		Элементы[ТекущийЭлементИмя].Свернуть(ЭлементКорняДерева.ПолучитьИдентификатор());
		Элементы[ТекущийЭлементИмя + "1"].Свернуть(ЭлементКорняДерева.ПолучитьИдентификатор());
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДерево(Команда)

	РазвернутьДеревоНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)

	ТекущийЭлементИмя = ПолучитьИмяТекущегоЭлементаФормыСЗаменой();
	
	ТекущееДеревоЗначений = ЭтотОбъект[ТекущийЭлементИмя]; // ДанныеФормыДерево
	ЭлементыКорняДерева = ТекущееДеревоЗначений.ПолучитьЭлементы();
	УстановитьСнятьФлажкиРекурсивно(ЭлементыКорняДерева);

КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	ТекущийЭлементИмя = ПолучитьИмяТекущегоЭлементаФормыСЗаменой();
	
	ТекущееДеревоЗначений = ЭтотОбъект[ТекущийЭлементИмя]; // ДанныеФормыДерево
	ЭлементыКорняДерева = ТекущееДеревоЗначений.ПолучитьЭлементы();
	УстановитьСнятьФлажкиРекурсивно(ЭлементыКорняДерева, 0);

КонецПроцедуры

&НаКлиенте
Процедура СкрытьНастройки(Команда)

	Элементы.ГруппаНастройки.Видимость = Не Элементы.ГруппаНастройки.Видимость;
	
	Если Элементы.ГруппаНастройки.Видимость Тогда
		Элементы.ОбновитьТабличныйДокументИСписокРегистраСведенийМини.Видимость = Ложь;
		Элементы.СкрытьНастройки.Картинка = БиблиотекаКартинок.СтрелкаВлево;
	Иначе
		Элементы.ОбновитьТабличныйДокументИСписокРегистраСведенийМини.Видимость = Истина;
		Элементы.СкрытьНастройки.Картинка = БиблиотекаКартинок.СтрелкаВправо;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСпискиОтборов(Команда)

	ЗаполнитьТаблицыОтборов();

	РазвернутьДеревоНаКлиенте("ОтборОбъект");
	РазвернутьДеревоНаКлиенте("ОтборФункция");

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТабличныйДокументИСписокРегистраСведений(Команда)

	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;

	СтруктураОтборов = ПолучитьОтборыИзПанелиНастроек();

	Если Элементы.СтраницыРеестрФункций.ТекущаяСтраница = Элементы.СтраницаОтчет Тогда
		ОбновитьТабличныйДокументНаСервере(СтруктураОтборов);
	Иначе
		ОбновитьСписокРегистраСведенийНаСервере(СтруктураОтборов);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодборДляВключения(Команда)
	
	ИмяТекущегоЭлемента = ПолучитьИмяТекущегоЭлементаФормыСЗаменой();
	ИмяТекущегоСравочника = ПолучитьИмяТекущегоСправочника(ИмяТекущегоЭлемента);
	Если ПустаяСтрока(ИмяТекущегоСравочника) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", ЭтотОбъект, "Включить");
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("МножественныйВыбор", Истина);
	
	ОткрытьФорму(
		"Справочник." + ИмяТекущегоСравочника + ".ФормаВыбора",
		ПараметрыОткрытия,
		ЭтотОбъект, , , ,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборДляИсключения(Команда)
	
	ИмяТекущегоЭлемента = ПолучитьИмяТекущегоЭлементаФормыСЗаменой();
	ИмяТекущегоСравочника = ПолучитьИмяТекущегоСправочника(ИмяТекущегоЭлемента);
	Если ПустаяСтрока(ИмяТекущегоСравочника) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", ЭтотОбъект, "Выключить");
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("МножественныйВыбор", Истина);
	
	ОткрытьФорму(
		"Справочник." + ИмяТекущегоСравочника + ".ФормаВыбора",
		ПараметрыОткрытия,
		ЭтотОбъект, , , ,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Обработчик события нажатия кнопки "ОткрытьОПрограмме".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ОткрытьОПрограмме(Команда)
	
	ОткрытьФорму("Обработка.УправлениеРеестромФункций.Форма.ОПродукте", , , , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОтчет(Команда)
	
	РежимОтображения = 0;
	РежимОтображенияПриИзменении();
	Элементы.РежимОтчет.Пометка = Истина;
	Элементы.РежимРегистр.Пометка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимРегистр(Команда)
	
	РежимОтображения = 1;
	РежимОтображенияПриИзменении();
	Элементы.РежимОтчет.Пометка = Ложь;
	Элементы.РежимРегистр.Пометка = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицыОтборов()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбъектыФункцийГруппы.Ссылка КАК Группа,
	|	ОбъектыФункций.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ОбъектыФункций КАК ОбъектыФункцийГруппы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыФункций КАК ОбъектыФункций
	|		ПО (ОбъектыФункцийГруппы.Ссылка = ОбъектыФункций.Родитель
	|		И НЕ ОбъектыФункций.ПометкаУдаления
	|		И НЕ ОбъектыФункций.ЭтоГруппа)
	|ГДЕ
	|	НЕ ОбъектыФункцийГруппы.ПометкаУдаления
	|	И ОбъектыФункцийГруппы.ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбъектыФункцийГруппы.Код,
	|	ОбъектыФункций.Наименование
	|ИТОГИ
	|ПО
	|	Группа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗадачиУчетныхСистем.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЗадачиУчетныхСистем КАК ЗадачиУчетныхСистем
	|ГДЕ
	|	НЕ ЗадачиУчетныхСистем.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗадачиУчетныхСистем.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФункцииПервыйУровень.Ссылка КАК ГруппаПервыйУровень,
	|	ФункцииВторойУровень.Ссылка КАК ГруппаВторойУровень,
	|	Функции.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Функции КАК ФункцииПервыйУровень
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Функции КАК ФункцииВторойУровень
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Функции КАК Функции
	|			ПО ФункцииВторойУровень.Ссылка = Функции.Родитель
	|			И НЕ Функции.ПометкаУдаления
	|		ПО ФункцииПервыйУровень.Ссылка = ФункцииВторойУровень.Родитель
	|		И НЕ ФункцииВторойУровень.ПометкаУдаления
	|ГДЕ
	|	НЕ ФункцииПервыйУровень.ПометкаУдаления
	|	И ФункцииПервыйУровень.Родитель = ЗНАЧЕНИЕ(Справочник.Функции.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФункцииПервыйУровень.Код,
	|	ФункцииВторойУровень.Код,
	|	Функции.Наименование
	|ИТОГИ
	|ПО
	|	ГруппаПервыйУровень,
	|	ГруппаВторойУровень
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Действия.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Действия КАК Действия
	|ГДЕ
	|	НЕ Действия.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|
	|	Действия.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Статусы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Статусы КАК Статусы
	|ГДЕ
	|	НЕ Статусы.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|
	|	Статусы.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	НЕ Пользователи.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Пользователи.Наименование";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	// Отбор объект
	ВыборкаОтборОбъект = РезультатЗапроса[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ЭлементыКорняДерева = ОтборОбъект.ПолучитьЭлементы();
	ЭлементыКорняДерева.Очистить();
	Пока ВыборкаОтборОбъект.Следующий() Цикл
		// группировка
		ЭлементКорняДерева = ЭлементыКорняДерева.Добавить();
		ЭлементКорняДерева.Использование = 1;
		ЭлементКорняДерева.ОтборЭлемент  = ВыборкаОтборОбъект.Группа;
		// элементы
		Выборка = ВыборкаОтборОбъект.Выбрать();
		ЭлементыПервогоУровня = ЭлементКорняДерева.ПолучитьЭлементы();
		Пока Выборка.Следующий() Цикл
			Если Не ЗначениеЗаполнено(Выборка.Ссылка) Тогда
				Продолжить;
			КонецЕсли;
			ЭлементПервогоУровняДерева = ЭлементыПервогоУровня.Добавить();
			ЭлементПервогоУровняДерева.Использование = 1;
			ЭлементПервогоУровняДерева.ОтборЭлемент  = Выборка.Ссылка;
		КонецЦикла;
	КонецЦикла;
	
	// Отбор задача
	ВыборкаОтборЗадача = РезультатЗапроса[1].Выбрать();
	ЭлементыКорняДерева = ОтборЗадача.ПолучитьЭлементы();
	ЭлементыКорняДерева.Очистить();
	Пока ВыборкаОтборЗадача.Следующий() Цикл
		// элементы
		ЭлементКорняДерева = ЭлементыКорняДерева.Добавить();
		ЭлементКорняДерева.Использование = 1;
		ЭлементКорняДерева.ОтборЭлемент  = ВыборкаОтборЗадача.Ссылка;
	КонецЦикла;
	
	// Отбор функция
	ВыборкаОтборФункция = РезультатЗапроса[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ЭлементыКорняДерева = ОтборФункция.ПолучитьЭлементы();
	ЭлементыКорняДерева.Очистить();
	Пока ВыборкаОтборФункция.Следующий() Цикл
		// группировка 1 уровень
		ЭлементКорняДерева = ЭлементыКорняДерева.Добавить();
		ЭлементКорняДерева.Использование = 1;
		ЭлементКорняДерева.ОтборЭлемент  = ВыборкаОтборФункция.ГруппаПервыйУровень;
		// элементы 1 уровень
		ВыборкаПервыйУровень = ВыборкаОтборФункция.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ЭлементыПервогоУровня = ЭлементКорняДерева.ПолучитьЭлементы();
		Пока ВыборкаПервыйУровень.Следующий() Цикл
			Если Не ЗначениеЗаполнено(ВыборкаПервыйУровень.ГруппаВторойУровень) Тогда
				Продолжить;
			КонецЕсли;
			// группировка 2 уровень
			ЭлементПервогоУровняДерева = ЭлементыПервогоУровня.Добавить();
			ЭлементПервогоУровняДерева.Использование = 1;
			ЭлементПервогоУровняДерева.ОтборЭлемент  = ВыборкаПервыйУровень.ГруппаВторойУровень;
			// элементы 2 уровень
			Выборка = ВыборкаПервыйУровень.Выбрать();
			ЭлементыВторогоУровня = ЭлементПервогоУровняДерева.ПолучитьЭлементы();
			Пока Выборка.Следующий() Цикл
				Если Не ЗначениеЗаполнено(Выборка.Ссылка) Тогда
					Продолжить;
				КонецЕсли;
				ЭлементВторогоУровняДерева = ЭлементыВторогоУровня.Добавить();
				ЭлементВторогоУровняДерева.Использование = 1;
				ЭлементВторогоУровняДерева.ОтборЭлемент  = Выборка.Ссылка;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	// Отбор действие
	ВыборкаОтборДействие = РезультатЗапроса[3].Выбрать();
	ЭлементыКорняДерева = ОтборДействие.ПолучитьЭлементы();
	ЭлементыКорняДерева.Очистить();
	Пока ВыборкаОтборДействие.Следующий() Цикл
		// элементы
		ЭлементКорняДерева = ЭлементыКорняДерева.Добавить();
		ЭлементКорняДерева.Использование = 1;
		ЭлементКорняДерева.ОтборЭлемент  = ВыборкаОтборДействие.Ссылка;
	КонецЦикла;
	
	// Отбор статус
	ВыборкаОтборСтатус = РезультатЗапроса[4].Выбрать();
	ЭлементыКорняДерева = ОтборСтатус.ПолучитьЭлементы();
	ЭлементыКорняДерева.Очистить();
	Пока ВыборкаОтборСтатус.Следующий() Цикл
		// элементы
		ЭлементКорняДерева = ЭлементыКорняДерева.Добавить();
		ЭлементКорняДерева.Использование = 1;
		ЭлементКорняДерева.ОтборЭлемент  = ВыборкаОтборСтатус.Ссылка;
	КонецЦикла;
	
	// Отбор автор
	ВыборкаОтборАвтор = РезультатЗапроса[5].Выбрать();
	ЭлементыКорняДерева = ОтборАвтор.ПолучитьЭлементы();
	ЭлементыКорняДерева.Очистить();
	Пока ВыборкаОтборАвтор.Следующий() Цикл
		// элементы
		ЭлементКорняДерева = ЭлементыКорняДерева.Добавить();
		ЭлементКорняДерева.Использование = 1;
		ЭлементКорняДерева.ОтборЭлемент  = ВыборкаОтборАвтор.Ссылка;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ВключитьВыключитьОтборы(ИмяНастройкиОтбора)

	ИмяОтбора = СтрЗаменить(ИмяНастройкиОтбора, "Использовать", "");

	ВидимостьОтбора = ЭтотОбъект[ИмяНастройкиОтбора]; // Булево
	Элементы[ИмяОтбора].Видимость = ВидимостьОтбора;
	Элементы[ИмяОтбора + "1"].Видимость = ВидимостьОтбора;
	Элементы[ИмяОтбора + "Группа"].Видимость = ВидимостьОтбора;

	Элементы.ОбновитьСпискиОтборов.Видимость = ИспользоватьОтборАвтор Или ИспользоватьОтборДействие Или ИспользоватьОтборЗадача
		Или ИспользоватьОтборОбъект Или ИспользоватьОтборСтатус Или ИспользоватьОтборФункция;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСоответствиеДоступныхОтборов()

	СоответствиеДоступныхОтборов = Новый Соответствие;

	СоответствиеДоступныхОтборов.Вставить("ОтборАвтор", ОтборАвтор);
	СоответствиеДоступныхОтборов.Вставить("ОтборДействие", ОтборДействие);
	СоответствиеДоступныхОтборов.Вставить("ОтборЗадача", ОтборЗадача);
	СоответствиеДоступныхОтборов.Вставить("ОтборОбъект", ОтборОбъект);
	СоответствиеДоступныхОтборов.Вставить("ОтборСтатус", ОтборСтатус);
	СоответствиеДоступныхОтборов.Вставить("ОтборФункция", ОтборФункция);

	Возврат СоответствиеДоступныхОтборов;

КонецФункции

&НаКлиенте
Процедура УстановитьСнятьФлажкиРекурсивно(
	ЭлементыУровняДерева,
	ЗначениеФлажка = 1,
	МассивДляУстановки = Неопределено,
	МассивДляСнятия = Неопределено)
	
	Для Каждого ЭлементУровняДерева Из ЭлементыУровняДерева Цикл
		
		Если ЗначениеФлажка = 1 И НЕ МассивДляУстановки = Неопределено Тогда
			Если НЕ МассивДляУстановки.Найти(ЭлементУровняДерева.ОтборЭлемент) = Неопределено Тогда
				ЭлементУровняДерева.Использование = 1;
			КонецЕсли;
		ИначеЕсли ЗначениеФлажка = 0 И НЕ МассивДляСнятия = Неопределено Тогда
			Если НЕ МассивДляСнятия.Найти(ЭлементУровняДерева.ОтборЭлемент) = Неопределено Тогда
				ЭлементУровняДерева.Использование = 0;
			КонецЕсли;
		Иначе
			ЭлементУровняДерева.Использование = ЗначениеФлажка;
		КонецЕсли;
		
		УстановитьСнятьФлажкиРекурсивно(
			ЭлементУровняДерева.ПолучитьЭлементы(),
			ЗначениеФлажка,
			МассивДляУстановки,
			МассивДляСнятия);
		
	КонецЦикла;
	
	Если ЭлементыУровняДерева.Количество() Тогда
		
		Родитель = ЭлементУровняДерева.ПолучитьРодителя();
		Пока Не Родитель = Неопределено Цикл
			Родитель.Использование = УстановитьЗначениеФлажкаРодителя(Родитель);
			Родитель = Родитель.ПолучитьРодителя();
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользованиеИзменение()
	
	ТекущийЭлементИмя = ПолучитьИмяТекущегоЭлементаФормыСЗаменой();
	
	ТекущиеДанные = Элементы[ТекущийЭлементИмя].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийЭлементИмяБезЗамены = ПолучитьИмяТекущегоЭлементаФормы();
	Если НЕ ТекущийЭлементИмяБезЗамены = ТекущийЭлементИмя Тогда
		ТекущиеДанныеБезЗамены = Элементы[ТекущийЭлементИмяБезЗамены].ТекущиеДанные;
		Если ТекущиеДанныеБезЗамены = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Если ТекущиеДанныеБезЗамены.Использование = 2 Тогда
			ТекущиеДанныеБезЗамены.Использование = 0;
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущиеДанные.Использование = 2 Тогда
		ТекущиеДанные.Использование = 0;
	КонецЕсли;

	Идентификатор = ТекущиеДанные.ПолучитьИдентификатор();
	ТекущееДеревоЗначений = ЭтотОбъект[ТекущийЭлементИмя]; // ДанныеФормыДерево
	ЭлементыДерева = ТекущееДеревоЗначений.НайтиПоИдентификатору(Идентификатор).ПолучитьЭлементы();
	Если ТекущиеДанные.Использование = 1 Тогда
		УстановитьСнятьФлажкиРекурсивно(ЭлементыДерева);
	Иначе
		УстановитьСнятьФлажкиРекурсивно(ЭлементыДерева, 0);
	КонецЕсли;

	Родитель = ТекущиеДанные.ПолучитьРодителя();
	Пока Не Родитель = Неопределено Цикл
		Родитель.Использование = УстановитьЗначениеФлажкаРодителя(Родитель);
		Родитель = Родитель.ПолучитьРодителя();
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ИспользованиеИзменениеБезЗаменыИмени()
	
	ТекущийЭлементИмя = ПолучитьИмяТекущегоЭлементаФормы();
	ТекущийЭлементИмяСЗаменой = ПолучитьИмяТекущегоЭлементаФормыСЗаменой();
	
	ТекущиеДанные = Элементы[ТекущийЭлементИмя].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Использование = 2 Тогда
		ТекущиеДанные.Использование = 0;
	КонецЕсли;

	Идентификатор = ТекущиеДанные.ПолучитьИдентификатор();
	ТекущееДеревоЗначений = ЭтотОбъект[ТекущийЭлементИмяСЗаменой]; // ДанныеФормыДерево
	ЭлементыДерева = ТекущееДеревоЗначений.НайтиПоИдентификатору(Идентификатор).ПолучитьЭлементы();
	Если ТекущиеДанные.Использование = 1 Тогда
		УстановитьСнятьФлажкиРекурсивно(ЭлементыДерева);
	Иначе
		УстановитьСнятьФлажкиРекурсивно(ЭлементыДерева, 0);
	КонецЕсли;

	Родитель = ТекущиеДанные.ПолучитьРодителя();
	Пока Не Родитель = Неопределено Цикл
		Родитель.Использование = УстановитьЗначениеФлажкаРодителя(Родитель);
		Родитель = Родитель.ПолучитьРодителя();
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Функция УстановитьЗначениеФлажкаРодителя(Родитель)

	ВПодчиненныхЕстьИстина = НайтиЗначениеФлажкаРодителяРекурсивно(Родитель.ПолучитьЭлементы(), 1);
	ВПодчиненныхЕстьЛожь   = НайтиЗначениеФлажкаРодителяРекурсивно(Родитель.ПолучитьЭлементы());

	Если ВПодчиненныхЕстьИстина И ВПодчиненныхЕстьЛожь Тогда
		Результат = 2;
	ИначеЕсли ВПодчиненныхЕстьИстина Тогда
		Результат = 1;
	Иначе
		Результат = 0;
	КонецЕсли;

	Возврат Результат;

КонецФункции

&НаКлиенте
Функция НайтиЗначениеФлажкаРодителяРекурсивно(ЭлементыДерева, Значение = 0)

	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		Если ЭлементДерева.Использование = Значение Или НайтиЗначениеФлажкаРодителяРекурсивно(
			ЭлементДерева.ПолучитьЭлементы(), Значение) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

&НаКлиенте
Процедура РазвернутьДеревоНаКлиенте(ТекущееДеревоЗначенийИмя = "")
	
	Если ПустаяСтрока(ТекущееДеревоЗначенийИмя) Тогда
		ТекущееДеревоЗначенийИмяДляРазвертки = ПолучитьИмяТекущегоЭлементаФормыСЗаменой();
	Иначе
		ТекущееДеревоЗначенийИмяДляРазвертки = ТекущееДеревоЗначенийИмя;
	КонецЕсли;
	
	ТекущееДеревоЗначений = ЭтотОбъект[ТекущееДеревоЗначенийИмяДляРазвертки]; // ДанныеФормыДерево
	ЭлементыКорняДерева = ТекущееДеревоЗначений.ПолучитьЭлементы();
	Для Каждого ЭлементКорняДерева Из ЭлементыКорняДерева Цикл
		Элементы[ТекущееДеревоЗначенийИмяДляРазвертки].Развернуть(ЭлементКорняДерева.ПолучитьИдентификатор(), Истина);
		Элементы[ТекущееДеревоЗначенийИмяДляРазвертки + "1"].Развернуть(ЭлементКорняДерева.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТабличныйДокументНаСервере(СтруктураОтборов)
	
	//Получаем схему из макета
	СхемаКомпоновкиДанных = Отчеты.АнализРеестраФункций.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	//Из схемы возьмем настройки по умолчанию
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	//Устанавливаем отборы
	УстановитьОтборыТабличногоДокумента(СтруктураОтборов, Настройки);
	
	//Помещаем в переменную данные о расшифровке данных
	ДанныеРасшифровкиСКД = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровкиСКД);
	
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровкиСКД);
	
	//Очищаем поле табличного документа
	ТабличноеПолеОтчета.Очистить();
	
	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабличноеПолеОтчета);

	Попытка

		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		ДанныеРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровкиСКД, УникальныйИдентификатор);

		ОтображениеСостояния = Элементы.ТабличноеПолеОтчета.ОтображениеСостояния;
		ОтображениеСостояния.Видимость                      = Ложь;
		ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
		ОтображениеСостояния.Картинка                       = Новый Картинка;
		ОтображениеСостояния.Текст                          = "";

	Исключение

		ОтображениеСостояния = Элементы.ТабличноеПолеОтчета.ОтображениеСостояния;
		ОтображениеСостояния.Видимость                      = Истина;
		ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
		ОтображениеСостояния.Картинка                       = Новый Картинка;
		ОтображениеСостояния.Текст                          = ОписаниеОшибки();

	КонецПопытки;
	
	ОбновитьСписокОшибок();
	
	РеестрФункцийСервер.РегистрацияСобытия("УправлениеРеестромФункций.ОбновитьТабличныйДокумент");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыТабличногоДокумента(СтруктураОтборов, Настройки, ДополнительныеПараметры = Неопределено)
	
	//Устанавливаем отборы
	Настройки.Отбор.Элементы.Очистить();
	
	//Задачи
	Если ИспользоватьОтборЗадача Тогда
		МассивЭлементовОтбора = Новый Массив;
		Если СтруктураОтборов.Свойство("МассивЗадач_Включены", МассивЭлементовОтбора) Тогда
			НовыйЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗадачаРеестра");
			НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
			НовыйЭлементОтбора.ПравоеЗначение = МассивЭлементовОтбора;
			НовыйЭлементОтбора.Использование  = Истина;
		ИначеЕсли СтруктураОтборов.Свойство("МассивЗадач_Выключены", МассивЭлементовОтбора) Тогда
			НовыйЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗадачаРеестра");
			НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
			НовыйЭлементОтбора.ПравоеЗначение = МассивЭлементовОтбора;
			НовыйЭлементОтбора.Использование  = Истина;
		КонецЕсли;
	КонецЕсли;
	
	//Статусы
	Если ИспользоватьОтборСтатус Тогда
		МассивЭлементовОтбора = Новый Массив;
		Если СтруктураОтборов.Свойство("МассивСтатусы_Включены", МассивЭлементовОтбора) Тогда
			НовыйЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СтатусЗадачи");
			НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
			НовыйЭлементОтбора.ПравоеЗначение = МассивЭлементовОтбора;
			НовыйЭлементОтбора.Использование  = Истина;
		ИначеЕсли СтруктураОтборов.Свойство("МассивСтатусы_Выключены", МассивЭлементовОтбора) Тогда
			НовыйЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СтатусЗадачи");
			НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
			НовыйЭлементОтбора.ПравоеЗначение = МассивЭлементовОтбора;
			НовыйЭлементОтбора.Использование  = Истина;
		КонецЕсли;
	КонецЕсли;
	
	//Автор
	Если ИспользоватьОтборАвтор Тогда
		МассивЭлементовОтбора = Новый Массив;
		Если СтруктураОтборов.Свойство("МассивАвтор_Включены", МассивЭлементовОтбора) Тогда
			НовыйЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("АвторЗадачи");
			НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
			НовыйЭлементОтбора.ПравоеЗначение = МассивЭлементовОтбора;
			НовыйЭлементОтбора.Использование  = Истина;
		ИначеЕсли СтруктураОтборов.Свойство("МассивАвтор_Выключены", МассивЭлементовОтбора) Тогда
			НовыйЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("АвторЗадачи");
			НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
			НовыйЭлементОтбора.ПравоеЗначение = МассивЭлементовОтбора;
			НовыйЭлементОтбора.Использование  = Истина;
		КонецЕсли;
	КонецЕсли;
	
	//Действие
	Если ИспользоватьОтборДействие Тогда
		МассивЭлементовОтбора = Новый Массив;
		Если СтруктураОтборов.Свойство("МассивДействие_Включены", МассивЭлементовОтбора) Тогда
			НовыйЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Действие");
			НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
			НовыйЭлементОтбора.ПравоеЗначение = МассивЭлементовОтбора;
			НовыйЭлементОтбора.Использование  = Истина;
		ИначеЕсли СтруктураОтборов.Свойство("МассивДействие_Выключены", МассивЭлементовОтбора) Тогда
			НовыйЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Действие");
			НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
			НовыйЭлементОтбора.ПравоеЗначение = МассивЭлементовОтбора;
			НовыйЭлементОтбора.Использование  = Истина;
		КонецЕсли;
	КонецЕсли;
	
	//Объект
	Если ИспользоватьОтборОбъект Тогда
		МассивЭлементовОтбора = Новый Массив;
		Если СтруктураОтборов.Свойство("МассивОбъект_Включены", МассивЭлементовОтбора) Тогда
			НовыйЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ОбъектРеестра");
			НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
			НовыйЭлементОтбора.ПравоеЗначение = МассивЭлементовОтбора;
			НовыйЭлементОтбора.Использование  = Истина;
		ИначеЕсли СтруктураОтборов.Свойство("МассивОбъект_Выключены", МассивЭлементовОтбора) Тогда
			НовыйЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ОбъектРеестра");
			НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
			НовыйЭлементОтбора.ПравоеЗначение = МассивЭлементовОтбора;
			НовыйЭлементОтбора.Использование  = Истина;
		КонецЕсли;
	КонецЕсли;
	
	//Функция
	Если ИспользоватьОтборФункция Тогда
		МассивЭлементовОтбора = Новый Массив;
		Если СтруктураОтборов.Свойство("МассивФункции_Включены", МассивЭлементовОтбора) Тогда
			НовыйЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ФункцияРеестра");
			НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
			НовыйЭлементОтбора.ПравоеЗначение = МассивЭлементовОтбора;
			НовыйЭлементОтбора.Использование  = Истина;
		ИначеЕсли СтруктураОтборов.Свойство("МассивФункции_Выключены", МассивЭлементовОтбора) Тогда
			НовыйЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ФункцияРеестра");
			НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
			НовыйЭлементОтбора.ПравоеЗначение = МассивЭлементовОтбора;
			НовыйЭлементОтбора.Использование  = Истина;
		КонецЕсли;
	КонецЕсли;
	
	//Проект
	НовыйЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Проект");
	НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	НовыйЭлементОтбора.ПравоеЗначение = ОтборПроект;
	НовыйЭлементОтбора.Использование  = Истина;

КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокРегистраСведенийНаСервере(СтруктураОтборов)
	
	//Устанавливаем отборы
	СписокРегистраСведений.Отбор.Элементы.Очистить();
	
	//Задачи
	Если ИспользоватьОтборЗадача Тогда
		МассивЭлементовОтбора = Новый Массив;
		Если СтруктураОтборов.Свойство("МассивЗадач_Включены", МассивЭлементовОтбора) Тогда
			НовыйЭлементОтбора = СписокРегистраСведений.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗадачаРеестра");
			НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
			НовыйЭлементОтбора.ПравоеЗначение = МассивЭлементовОтбора;
			НовыйЭлементОтбора.Использование  = Истина;
		ИначеЕсли СтруктураОтборов.Свойство("МассивЗадач_Выключены", МассивЭлементовОтбора) Тогда
			НовыйЭлементОтбора = СписокРегистраСведений.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗадачаРеестра");
			НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
			НовыйЭлементОтбора.ПравоеЗначение = МассивЭлементовОтбора;
			НовыйЭлементОтбора.Использование  = Истина;
		КонецЕсли;
	КонецЕсли;
	
	//Статусы
	Если ИспользоватьОтборСтатус Тогда
		МассивЭлементовОтбора = Новый Массив;
		Если СтруктураОтборов.Свойство("МассивСтатусы_Включены", МассивЭлементовОтбора) Тогда
			НовыйЭлементОтбора = СписокРегистраСведений.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СтатусЗадачи");
			НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
			НовыйЭлементОтбора.ПравоеЗначение = МассивЭлементовОтбора;
			НовыйЭлементОтбора.Использование  = Истина;
		ИначеЕсли СтруктураОтборов.Свойство("МассивСтатусы_Выключены", МассивЭлементовОтбора) Тогда
			НовыйЭлементОтбора = СписокРегистраСведений.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СтатусЗадачи");
			НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
			НовыйЭлементОтбора.ПравоеЗначение = МассивЭлементовОтбора;
			НовыйЭлементОтбора.Использование  = Истина;
		КонецЕсли;
	КонецЕсли;
	
	//Автор
	Если ИспользоватьОтборАвтор Тогда
		МассивЭлементовОтбора = Новый Массив;
		Если СтруктураОтборов.Свойство("МассивАвтор_Включены", МассивЭлементовОтбора) Тогда
			НовыйЭлементОтбора = СписокРегистраСведений.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("АвторЗадачи");
			НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
			НовыйЭлементОтбора.ПравоеЗначение = МассивЭлементовОтбора;
			НовыйЭлементОтбора.Использование  = Истина;
		ИначеЕсли СтруктураОтборов.Свойство("МассивАвтор_Выключены", МассивЭлементовОтбора) Тогда
			НовыйЭлементОтбора = СписокРегистраСведений.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("АвторЗадачи");
			НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
			НовыйЭлементОтбора.ПравоеЗначение = МассивЭлементовОтбора;
			НовыйЭлементОтбора.Использование  = Истина;
		КонецЕсли;
	КонецЕсли;
	
	//Действие
	Если ИспользоватьОтборДействие Тогда
		МассивЭлементовОтбора = Новый Массив;
		Если СтруктураОтборов.Свойство("МассивДействие_Включены", МассивЭлементовОтбора) Тогда
			НовыйЭлементОтбора = СписокРегистраСведений.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Действие");
			НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
			НовыйЭлементОтбора.ПравоеЗначение = МассивЭлементовОтбора;
			НовыйЭлементОтбора.Использование  = Истина;
		ИначеЕсли СтруктураОтборов.Свойство("МассивДействие_Выключены", МассивЭлементовОтбора) Тогда
			НовыйЭлементОтбора = СписокРегистраСведений.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Действие");
			НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
			НовыйЭлементОтбора.ПравоеЗначение = МассивЭлементовОтбора;
			НовыйЭлементОтбора.Использование  = Истина;
		КонецЕсли;
	КонецЕсли;
	
	//Объект
	Если ИспользоватьОтборОбъект Тогда
		МассивЭлементовОтбора = Новый Массив;
		Если СтруктураОтборов.Свойство("МассивОбъект_Включены", МассивЭлементовОтбора) Тогда
			НовыйЭлементОтбора = СписокРегистраСведений.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ОбъектРеестра");
			НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
			НовыйЭлементОтбора.ПравоеЗначение = МассивЭлементовОтбора;
			НовыйЭлементОтбора.Использование  = Истина;
		ИначеЕсли СтруктураОтборов.Свойство("МассивОбъект_Выключены", МассивЭлементовОтбора) Тогда
			НовыйЭлементОтбора = СписокРегистраСведений.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ОбъектРеестра");
			НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
			НовыйЭлементОтбора.ПравоеЗначение = МассивЭлементовОтбора;
			НовыйЭлементОтбора.Использование  = Истина;
		КонецЕсли;
	КонецЕсли;
	
	//Функция
	Если ИспользоватьОтборФункция Тогда
		МассивЭлементовОтбора = Новый Массив;
		Если СтруктураОтборов.Свойство("МассивФункции_Включены", МассивЭлементовОтбора) Тогда
			НовыйЭлементОтбора = СписокРегистраСведений.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ФункцияРеестра");
			НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
			НовыйЭлементОтбора.ПравоеЗначение = МассивЭлементовОтбора;
			НовыйЭлементОтбора.Использование  = Истина;
		ИначеЕсли СтруктураОтборов.Свойство("МассивФункции_Выключены", МассивЭлементовОтбора) Тогда
			НовыйЭлементОтбора = СписокРегистраСведений.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ФункцияРеестра");
			НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
			НовыйЭлементОтбора.ПравоеЗначение = МассивЭлементовОтбора;
			НовыйЭлементОтбора.Использование  = Истина;
		КонецЕсли;
	КонецЕсли;
	
	//Проект
	НовыйЭлементОтбора = СписокРегистраСведений.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗадачаРеестра.Проект");
	НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	НовыйЭлементОтбора.ПравоеЗначение = ОтборПроект;
	НовыйЭлементОтбора.Использование  = Истина;

	Элементы.СписокРегистраСведений.Обновить();
	
	ОбновитьСписокОшибок();
	
	РеестрФункцийСервер.РегистрацияСобытия("УправлениеРеестромФункций.ОбновитьСписокРегистраСведений");
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьОтборыИзПанелиНастроек()

	СтруктураОтборов = Новый Структура;
	
	// Задачи
	МассивЗадач_Включены  = Новый Массив; // Массив из СправочникСсылка.ЗадачиУчетныхСистем
	МассивЗадач_Выключены = Новый Массив; // Массив из СправочникСсылка.ЗадачиУчетныхСистем
	ЭлементыДерева = ОтборЗадача.ПолучитьЭлементы();
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		Если ЭлементДерева.Использование Тогда
			МассивЗадач_Включены.Добавить(ЭлементДерева.ОтборЭлемент);
		Иначе
			МассивЗадач_Выключены.Добавить(ЭлементДерева.ОтборЭлемент);
		КонецЕсли;
	КонецЦикла;
	Если МассивЗадач_Включены.Количество() < МассивЗадач_Выключены.Количество() Тогда
		СтруктураОтборов.Вставить("МассивЗадач_Включены", МассивЗадач_Включены);
	ИначеЕсли МассивЗадач_Выключены.Количество() Тогда
		СтруктураОтборов.Вставить("МассивЗадач_Выключены", МассивЗадач_Выключены);
	КонецЕсли;
	
	// Статусы
	МассивСтатусы_Включены  = Новый Массив; // Массив из СправочникСсылка.Статусы
	МассивСтатусы_Выключены = Новый Массив; // Массив из СправочникСсылка.Статусы
	ЭлементыДерева = ОтборСтатус.ПолучитьЭлементы();
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		Если ЭлементДерева.Использование Тогда
			МассивСтатусы_Включены.Добавить(ЭлементДерева.ОтборЭлемент);
		Иначе
			МассивСтатусы_Выключены.Добавить(ЭлементДерева.ОтборЭлемент);
		КонецЕсли;
	КонецЦикла;
	Если МассивСтатусы_Включены.Количество() < МассивСтатусы_Выключены.Количество() Тогда
		СтруктураОтборов.Вставить("МассивСтатусы_Включены", МассивСтатусы_Включены);
	ИначеЕсли МассивСтатусы_Выключены.Количество() Тогда
		СтруктураОтборов.Вставить("МассивСтатусы_Выключены", МассивСтатусы_Выключены);
	КонецЕсли;
	
	// Автор
	МассивАвтор_Включены  = Новый Массив; // Массив из СправочникСсылка.Пользователи
	МассивАвтор_Выключены = Новый Массив; // Массив из СправочникСсылка.Пользователи
	ЭлементыДерева = ОтборАвтор.ПолучитьЭлементы();
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		Если ЭлементДерева.Использование Тогда
			МассивАвтор_Включены.Добавить(ЭлементДерева.ОтборЭлемент);
		Иначе
			МассивАвтор_Выключены.Добавить(ЭлементДерева.ОтборЭлемент);
		КонецЕсли;
	КонецЦикла;
	Если МассивАвтор_Включены.Количество() < МассивАвтор_Выключены.Количество() Тогда
		СтруктураОтборов.Вставить("МассивАвтор_Включены", МассивАвтор_Включены);
	ИначеЕсли МассивАвтор_Выключены.Количество() Тогда
		СтруктураОтборов.Вставить("МассивАвтор_Выключены", МассивАвтор_Выключены);
	КонецЕсли;
	
	// Действие
	МассивДействие_Включены  = Новый Массив; // Массив из СправочникСсылка.Действия
	МассивДействие_Выключены = Новый Массив; // Массив из СправочникСсылка.Действия
	ЭлементыДерева = ОтборДействие.ПолучитьЭлементы();
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		Если ЭлементДерева.Использование Тогда
			МассивДействие_Включены.Добавить(ЭлементДерева.ОтборЭлемент);
		Иначе
			МассивДействие_Выключены.Добавить(ЭлементДерева.ОтборЭлемент);
		КонецЕсли;
	КонецЦикла;
	Если МассивДействие_Включены.Количество() < МассивДействие_Выключены.Количество() Тогда
		СтруктураОтборов.Вставить("МассивДействие_Включены", МассивДействие_Включены);
	ИначеЕсли МассивДействие_Выключены.Количество() Тогда
		СтруктураОтборов.Вставить("МассивДействие_Выключены", МассивДействие_Выключены);
	КонецЕсли;
	
	// Объект
	МассивОбъект_Включены  = Новый Массив; // Массив из СправочникСсылка.ОбъектыФункций
	МассивОбъект_Выключены = Новый Массив; // Массив из СправочникСсылка.ОбъектыФункций
	ГруппыЭлементовДерева = ОтборОбъект.ПолучитьЭлементы();
	Для Каждого ГруппаЭлементаДерева Из ГруппыЭлементовДерева Цикл
		ЭлементыДерева = ГруппаЭлементаДерева.ПолучитьЭлементы();
		Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
			Если ЭлементДерева.Использование Тогда
				МассивОбъект_Включены.Добавить(ЭлементДерева.ОтборЭлемент);
			Иначе
				МассивОбъект_Выключены.Добавить(ЭлементДерева.ОтборЭлемент);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Если МассивОбъект_Включены.Количество() < МассивОбъект_Выключены.Количество() Тогда
		СтруктураОтборов.Вставить("МассивОбъект_Включены", МассивОбъект_Включены);
	ИначеЕсли МассивОбъект_Выключены.Количество() Тогда
		СтруктураОтборов.Вставить("МассивОбъект_Выключены", МассивОбъект_Выключены);
	КонецЕсли;
		
	// Функции
	МассивФункции_Включены  = Новый Массив; // Массив из СправочникСсылка.Функции
	МассивФункции_Выключены = Новый Массив; // Массив из СправочникСсылка.Функции
	ГруппыЭлементовДереваУровень1 = ОтборФункция.ПолучитьЭлементы();
	Для Каждого ГруппаЭлементаДереваУровень1 Из ГруппыЭлементовДереваУровень1 Цикл
		ГруппыЭлементовДереваУровень2 = ГруппаЭлементаДереваУровень1.ПолучитьЭлементы();
		Для Каждого ГруппаЭлементаДерева Из ГруппыЭлементовДереваУровень2 Цикл
			ЭлементыДерева = ГруппаЭлементаДерева.ПолучитьЭлементы();
			Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
				Если ЭлементДерева.Использование Тогда
					МассивФункции_Включены.Добавить(ЭлементДерева.ОтборЭлемент);
				Иначе
					МассивФункции_Выключены.Добавить(ЭлементДерева.ОтборЭлемент);
				КонецЕсли;
			КонецЦикла;
			Если ГруппаЭлементаДерева.Использование И МассивФункции_Включены.Найти(ГруппаЭлементаДерева.ОтборЭлемент) = Неопределено Тогда
				МассивФункции_Включены.Добавить(ГруппаЭлементаДерева.ОтборЭлемент);
			ИначеЕсли НЕ ГруппаЭлементаДерева.Использование И МассивФункции_Выключены.Найти(ГруппаЭлементаДерева.ОтборЭлемент) = Неопределено Тогда
				МассивФункции_Выключены.Добавить(ГруппаЭлементаДерева.ОтборЭлемент);
			КонецЕсли;
		КонецЦикла;
		Если ГруппаЭлементаДереваУровень1.Использование И МассивФункции_Включены.Найти(ГруппаЭлементаДереваУровень1.ОтборЭлемент) = Неопределено Тогда
			МассивФункции_Включены.Добавить(ГруппаЭлементаДереваУровень1.ОтборЭлемент);
		ИначеЕсли НЕ ГруппаЭлементаДереваУровень1.Использование И МассивФункции_Включены.Найти(ГруппаЭлементаДереваУровень1.ОтборЭлемент) = Неопределено Тогда
			МассивФункции_Выключены.Добавить(ГруппаЭлементаДереваУровень1.ОтборЭлемент);
		КонецЕсли;
	КонецЦикла;
	Если МассивФункции_Включены.Количество() < МассивФункции_Выключены.Количество() Тогда
		СтруктураОтборов.Вставить("МассивФункции_Включены", МассивФункции_Включены);
	ИначеЕсли МассивФункции_Выключены.Количество() Тогда
		СтруктураОтборов.Вставить("МассивФункции_Выключены", МассивФункции_Выключены);
	КонецЕсли;

	Возврат СтруктураОтборов;

КонецФункции

&НаСервере
Функция ПолучитьОтборыИзПанелиНастроекНаСервере()

	СтруктураОтборов = Новый Структура;
	
	// Задачи
	МассивЗадач_Включены  = Новый Массив; // Массив из СправочникСсылка.ЗадачиУчетныхСистем
	МассивЗадач_Выключены = Новый Массив; // Массив из СправочникСсылка.ЗадачиУчетныхСистем
	ЭлементыДерева = ОтборЗадача.ПолучитьЭлементы();
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		Если ЭлементДерева.Использование Тогда
			МассивЗадач_Включены.Добавить(ЭлементДерева.ОтборЭлемент);
		Иначе
			МассивЗадач_Выключены.Добавить(ЭлементДерева.ОтборЭлемент);
		КонецЕсли;
	КонецЦикла;
	Если МассивЗадач_Включены.Количество() < МассивЗадач_Выключены.Количество() Тогда
		СтруктураОтборов.Вставить("МассивЗадач_Включены", МассивЗадач_Включены);
	ИначеЕсли МассивЗадач_Выключены.Количество() Тогда
		СтруктураОтборов.Вставить("МассивЗадач_Выключены", МассивЗадач_Выключены);
	КонецЕсли;
	
	// Статусы
	МассивСтатусы_Включены  = Новый Массив; // Массив из СправочникСсылка.Статусы
	МассивСтатусы_Выключены = Новый Массив; // Массив из СправочникСсылка.Статусы
	ЭлементыДерева = ОтборСтатус.ПолучитьЭлементы();
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		Если ЭлементДерева.Использование Тогда
			МассивСтатусы_Включены.Добавить(ЭлементДерева.ОтборЭлемент);
		Иначе
			МассивСтатусы_Выключены.Добавить(ЭлементДерева.ОтборЭлемент);
		КонецЕсли;
	КонецЦикла;
	Если МассивСтатусы_Включены.Количество() < МассивСтатусы_Выключены.Количество() Тогда
		СтруктураОтборов.Вставить("МассивСтатусы_Включены", МассивСтатусы_Включены);
	ИначеЕсли МассивСтатусы_Выключены.Количество() Тогда
		СтруктураОтборов.Вставить("МассивСтатусы_Выключены", МассивСтатусы_Выключены);
	КонецЕсли;
	
	// Автор
	МассивАвтор_Включены  = Новый Массив; // Массив из СправочникСсылка.Пользователи
	МассивАвтор_Выключены = Новый Массив; // Массив из СправочникСсылка.Пользователи
	ЭлементыДерева = ОтборАвтор.ПолучитьЭлементы();
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		Если ЭлементДерева.Использование Тогда
			МассивАвтор_Включены.Добавить(ЭлементДерева.ОтборЭлемент);
		Иначе
			МассивАвтор_Выключены.Добавить(ЭлементДерева.ОтборЭлемент);
		КонецЕсли;
	КонецЦикла;
	Если МассивАвтор_Включены.Количество() < МассивАвтор_Выключены.Количество() Тогда
		СтруктураОтборов.Вставить("МассивАвтор_Включены", МассивАвтор_Включены);
	ИначеЕсли МассивАвтор_Выключены.Количество() Тогда
		СтруктураОтборов.Вставить("МассивАвтор_Выключены", МассивАвтор_Выключены);
	КонецЕсли;
	
	// Действие
	МассивДействие_Включены  = Новый Массив; // Массив из СправочникСсылка.Действия
	МассивДействие_Выключены = Новый Массив; // Массив из СправочникСсылка.Действия
	ЭлементыДерева = ОтборДействие.ПолучитьЭлементы();
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		Если ЭлементДерева.Использование Тогда
			МассивДействие_Включены.Добавить(ЭлементДерева.ОтборЭлемент);
		Иначе
			МассивДействие_Выключены.Добавить(ЭлементДерева.ОтборЭлемент);
		КонецЕсли;
	КонецЦикла;
	Если МассивДействие_Включены.Количество() < МассивДействие_Выключены.Количество() Тогда
		СтруктураОтборов.Вставить("МассивДействие_Включены", МассивДействие_Включены);
	ИначеЕсли МассивДействие_Выключены.Количество() Тогда
		СтруктураОтборов.Вставить("МассивДействие_Выключены", МассивДействие_Выключены);
	КонецЕсли;
	
	// Объект
	МассивОбъект_Включены  = Новый Массив; // Массив из СправочникСсылка.ОбъектыФункций
	МассивОбъект_Выключены = Новый Массив; // Массив из СправочникСсылка.ОбъектыФункций
	ГруппыЭлементовДерева = ОтборОбъект.ПолучитьЭлементы();
	Для Каждого ГруппаЭлементаДерева Из ГруппыЭлементовДерева Цикл
		ЭлементыДерева = ГруппаЭлементаДерева.ПолучитьЭлементы();
		Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
			Если ЭлементДерева.Использование Тогда
				МассивОбъект_Включены.Добавить(ЭлементДерева.ОтборЭлемент);
			Иначе
				МассивОбъект_Выключены.Добавить(ЭлементДерева.ОтборЭлемент);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Если МассивОбъект_Включены.Количество() < МассивОбъект_Выключены.Количество() Тогда
		СтруктураОтборов.Вставить("МассивОбъект_Включены", МассивОбъект_Включены);
	ИначеЕсли МассивОбъект_Выключены.Количество() Тогда
		СтруктураОтборов.Вставить("МассивОбъект_Выключены", МассивОбъект_Выключены);
	КонецЕсли;
		
	// Функции
	МассивФункции_Включены  = Новый Массив; // Массив из СправочникСсылка.Функции
	МассивФункции_Выключены = Новый Массив; // Массив из СправочникСсылка.Функции
	ГруппыЭлементовДереваУровень1 = ОтборФункция.ПолучитьЭлементы();
	Для Каждого ГруппаЭлементаДереваУровень1 Из ГруппыЭлементовДереваУровень1 Цикл
		ГруппыЭлементовДереваУровень2 = ГруппаЭлементаДереваУровень1.ПолучитьЭлементы();
		Для Каждого ГруппаЭлементаДерева Из ГруппыЭлементовДереваУровень2 Цикл
			ЭлементыДерева = ГруппаЭлементаДерева.ПолучитьЭлементы();
			Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
				Если ЭлементДерева.Использование Тогда
					МассивФункции_Включены.Добавить(ЭлементДерева.ОтборЭлемент);
				Иначе
					МассивФункции_Выключены.Добавить(ЭлементДерева.ОтборЭлемент);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	Если МассивФункции_Включены.Количество() < МассивФункции_Выключены.Количество() Тогда
		СтруктураОтборов.Вставить("МассивФункции_Включены", МассивФункции_Включены);
	ИначеЕсли МассивФункции_Выключены.Количество() Тогда
		СтруктураОтборов.Вставить("МассивФункции_Выключены", МассивФункции_Выключены);
	КонецЕсли;

	Возврат СтруктураОтборов;

КонецФункции

// Получить значение поля расшифровки.
// 
// Параметры:
//  Расшифровка - Произвольный - Расшифровка
// 
// Возвращаемое значение:
//  Неопределено, СправочникСсылка, Структура - Получить значение поля расшифровки:
// * Символ - Произвольный 
// * СтруктураПоля - Структура - :
// ** ЗадачаРеестра - СправочникСсылка.ЗадачиУчетныхСистем 
// ** ФункцияРеестра - СправочникСсылка.Функции 
// ** ОбъектРеестра - СправочникСсылка.ОбъектыФункций 
// * Ключ - РегистрСведенийКлючЗаписи.РеестрФункций - 
&НаСервере
Функция ПолучитьЗначениеПоляРасшифровки(Расшифровка)

	ЗначениеПоля = Null; // Произвольный

	ДанныеРасшифровкиСКД = ПолучитьИзВременногоХранилища(ДанныеРасшифровки); // ДанныеРасшифровкиКомпоновкиДанных
	Поля = ДанныеРасшифровкиСКД.Элементы[Расшифровка].ПолучитьПоля();
	Если Поля.Количество() = 1 Тогда
		ЗначениеПоля = Поля[0].Значение;
	ИначеЕсли Поля.Количество() = 5 И Поля[3].Значение = Ложь Тогда
		СтруктураПоля = Новый Структура;
		СтруктураПоля.Вставить("ЗадачаРеестра",  Поля[0].Значение);
		СтруктураПоля.Вставить("ФункцияРеестра", Поля[1].Значение);
		СтруктураПоля.Вставить("ОбъектРеестра",  Поля[2].Значение);
		ЗначениеПоля = Новый Структура;
		ЗначениеПоля.Вставить("Символ", Поля[4].Значение);
		ЗначениеПоля.Вставить("СтруктураПоля", СтруктураПоля);
		ЗначениеПоля.Вставить("Ключ", РегистрыСведений.РеестрФункций.СоздатьКлючЗаписи(СтруктураПоля));
	КонецЕсли;

	Если ЗначениеПоля = Null Или Не Поля.Количество() Тогда
		ЗначениеПоля = Неопределено;
	КонецЕсли;

	Возврат ЗначениеПоля;

КонецФункции

// Подключаемый обработка результата оповещения.
// 
// Параметры:
//  РезультатОповещения - Неопределено
//  ДополнительныеПараметры - Неопределено - Дополнительные параметры
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ДополнительныеПараметры = "Включить" Тогда
		
		Если НЕ РезультатОповещения = Неопределено Тогда
			
			ТекущийЭлементИмя = ПолучитьИмяТекущегоЭлементаФормыСЗаменой();

			ТекущееДеревоЗначений = ЭтотОбъект[ТекущийЭлементИмя]; // ДанныеФормыДерево
			ЭлементыКорняДерева = ТекущееДеревоЗначений.ПолучитьЭлементы();
			УстановитьСнятьФлажкиРекурсивно(ЭлементыКорняДерева, 1, РезультатОповещения);
			
		КонецЕсли;
		
		Возврат;
			
	КонецЕсли;
	
	Если ДополнительныеПараметры = "Выключить" Тогда
		
		Если НЕ РезультатОповещения = Неопределено Тогда
			
			ТекущийЭлементИмя = ПолучитьИмяТекущегоЭлементаФормыСЗаменой();

			ТекущееДеревоЗначений = ЭтотОбъект[ТекущийЭлементИмя]; // ДанныеФормыДерево
			ЭлементыКорняДерева = ТекущееДеревоЗначений.ПолучитьЭлементы();
			УстановитьСнятьФлажкиРекурсивно(ЭлементыКорняДерева, 0, , РезультатОповещения);
			
		КонецЕсли;
		
		Возврат;
			
	КонецЕсли;
	
	Если ОбновлятьТабличныйДокументПриРедактировании Тогда
		СтруктураОтборов = ПолучитьОтборыИзПанелиНастроек();
		ОбновитьТабличныйДокументНаСервере(СтруктураОтборов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИмяТекущегоЭлементаФормыСЗаменой()
	
	Если Прав(ТекущийЭлемент.Имя, 1) = "1" Тогда
		ТекущийЭлементИмя = Лев(ТекущийЭлемент.Имя, СтрДлина(ТекущийЭлемент.Имя) - 1);
	ИначеЕсли Прав(ТекущийЭлемент.Имя, 12) = "СтрокаПоиска" Тогда
		ТекущийЭлементИмя = Лев(ТекущийЭлемент.Имя, СтрДлина(ТекущийЭлемент.Имя) - 13);
	Иначе
		ТекущийЭлементИмя = ТекущийЭлемент.Имя;
	КонецЕсли;
	
	Возврат ТекущийЭлементИмя;
	
КонецФункции

&НаКлиенте
Функция ПолучитьИмяТекущегоЭлементаФормы()
	
	ТекущийЭлементИмя = ТекущийЭлемент.Имя;
	
	Возврат ТекущийЭлементИмя;
	
КонецФункции

&НаКлиенте
Функция ПолучитьИмяТекущегоСправочника(ИмяТекущегоЭлемента)
	
	Если СтрНайти(ИмяТекущегоЭлемента, "ОтборАвтор") Тогда
		ИмяТекущегоСправочника = "Пользователи";
	ИначеЕсли СтрНайти(ИмяТекущегоЭлемента, "ОтборДействие") Тогда
		ИмяТекущегоСправочника = "Действия";
	ИначеЕсли СтрНайти(ИмяТекущегоЭлемента, "ОтборЗадача") Тогда
		ИмяТекущегоСправочника = "ЗадачиУчетныхСистем";
	ИначеЕсли СтрНайти(ИмяТекущегоЭлемента, "ОтборОбъект") Тогда
		ИмяТекущегоСправочника = "ОбъектыФункций";
	ИначеЕсли СтрНайти(ИмяТекущегоЭлемента, "ОтборСтатус") Тогда
		ИмяТекущегоСправочника = "Статусы";
	ИначеЕсли СтрНайти(ИмяТекущегоЭлемента, "ОтборФункция") Тогда
		ИмяТекущегоСправочника = "Функции";
	Иначе
		ИмяТекущегоСправочника = "";
	КонецЕсли;
	
	Возврат ИмяТекущегоСправочника;
		
КонецФункции

&НаКлиенте
Процедура РежимОтображенияПриИзменении()

	Если РежимОтображения = 0 Тогда
		
		Элементы.СтраницыРеестрФункций.ТекущаяСтраница = Элементы.СтраницаОтчет;
		
		ОтображениеСостояния = Элементы.ТабличноеПолеОтчета.ОтображениеСостояния;
		ОтображениеСостояния.Видимость                      = Истина;
		ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
		ОтображениеСостояния.Картинка                       = БиблиотекаКартинок.ДиалогВосклицание;
		ОтображениеСостояния.Текст                          =
			"Для формирования отчета нажмите кнопку обновления в контекстном меню табличного документа или в панели настроек";
		
		Если ОбновлятьТабличныйДокументПриРедактировании Тогда
			СтруктураОтборов = ПолучитьОтборыИзПанелиНастроек();
			ОбновитьТабличныйДокументНаСервере(СтруктураОтборов);
		КонецЕсли;
		
	Иначе
		
		Элементы.СтраницыРеестрФункций.ТекущаяСтраница = Элементы.СтраницаРегистрСведений;
		
	КонецЕсли;

КонецПроцедуры

#Область ЗаполнитьОшибки

&НаСервере
Процедура ОбновитьСписокОшибок()
	
	МассивСообщений = Новый Массив; // Массив из ФорматированнаяСтрока
	
	ЗаполнитьОшибки_НеуникальностьСоздания(МассивСообщений);
	
	Если НЕ МассивСообщений.Количество() Тогда
		СообщениеСтрокаТекст = НСтр("ru = 'Ошибок и рекомендаций не найдено'");
		СообщениеСтрока = Новый ФорматированнаяСтрока(СообщениеСтрокаТекст, Новый Шрифт(, , Истина), ЦветаСтиля.ЦветАктивности);
		МассивСообщений.Добавить(СообщениеСтрока);
	КонецЕсли;
	
	СтрокаСообщений = Новый ФорматированнаяСтрока(МассивСообщений);
	
	ОшибкиДанных = Новый ФорматированныйДокумент;
	ОшибкиДанных.УстановитьФорматированнуюСтроку(СтрокаСообщений);
	
	Если МассивСообщений.Количество() > 1 И Элементы.ГруппаОшибкиДанных.Скрыта() Тогда
		Элементы.ГруппаОшибкиДанных.Показать();
	ИначеЕсли МассивСообщений.Количество() = 1 И НЕ Элементы.ГруппаОшибкиДанных.Скрыта() Тогда
		Элементы.ГруппаОшибкиДанных.Скрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОшибки_НеуникальностьСоздания(МассивСообщенийОбщий)
	
	МассивСообщений = Новый Массив; // Массив из Строка
	
	Выборка = ПолучитьНеуникальныеСоздания();
	Если Выборка.Количество() Тогда
		// Заголовок
		СообщениеСтрока = Новый ФорматированнаяСтрока("   Дубль действия ""Создан""   ",
			Новый Шрифт(, , Истина), ЦветаСтиля.ЦветФонаФормы, ЦветаСтиля.ЦветАкцента);
		МассивСообщений.Добавить(СообщениеСтрока);
		МассивСообщений.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
	КонецЕсли;
	Пока Выборка.Следующий() Цикл
		// Текст
		СообщениеСтрокаТекст = СтрШаблон(НСтр("ru = ' - %1'"), Выборка.ОбъектРеестраПредставление);
		СообщениеСтрока = Новый ФорматированнаяСтрока(СообщениеСтрокаТекст);
		МассивСообщений.Добавить(СообщениеСтрока);
		МассивСообщений.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
	КонецЦикла;
	Если МассивСообщений.Количество() Тогда
		// Рекомендации
		СообщениеСтрокаТекст = НСтр("ru = 'Рекомендации по исправлению:
			|1. Откройте список регистра сведений.
			|2. Установите в списке отбор по объекту с дублем и действию ""Создан"".
			|3. Удалите или измените дублирующуюся строку.'");
		СообщениеСтрока = Новый ФорматированнаяСтрока(СообщениеСтрокаТекст, , ЦветаСтиля.ЦветАкцента);
		МассивСообщений.Добавить(СообщениеСтрока);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивСообщенийОбщий, МассивСообщений);
	
КонецПроцедуры

// Получить неуникальные создания.
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Получить неуникальные создания:
//  * ОбъектРеестра - СправочникСсылка.ОбъектыФункций
//  * Действие - Число
//  * ОбъектРеестраПредставление - Строка
&НаСервере
Функция ПолучитьНеуникальныеСоздания()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеестрФункций.ОбъектРеестра КАК ОбъектРеестра,
		|	КОЛИЧЕСТВО(РеестрФункций.Действие) КАК Действие,
		|	РеестрФункций.ОбъектРеестра.Представление КАК ОбъектРеестраПредставление
		|ИЗ
		|	РегистрСведений.РеестрФункций КАК РеестрФункций
		|ГДЕ
		|	РеестрФункций.Действие = ЗНАЧЕНИЕ(Справочник.Действия.Создан)
		|
		|СГРУППИРОВАТЬ ПО
		|	РеестрФункций.ОбъектРеестра,
		|	РеестрФункций.ОбъектРеестра.Представление
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РеестрФункций.Действие) > 1";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
	
КонецФункции

#КонецОбласти

#КонецОбласти
