
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Отбор) Тогда
		ПараметрКоманды = Неопределено;
		Если Параметры.Отбор.Свойство("ПараметрКоманды", ПараметрКоманды) Тогда
			Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Статусы") Тогда
				УстановитьОтборДинамическогоСписка("ЗадачаРеестра.СтатусЗадачи", ПараметрКоманды);
			ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Действия") Тогда
				УстановитьОтборДинамическогоСписка("Действие", ПараметрКоманды);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборДинамическогоСписка(ЛевоеЗначение, Значение)
	
	Список.Отбор.Элементы.Очистить();
	
	Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных(ЛевоеЗначение);
	Отбор.ПравоеЗначение   = Значение;
	Отбор.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	Отбор.Использование    = Истина;
	
КонецПроцедуры

#КонецОбласти
