///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
//////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Отбор) Тогда
		ПараметрКоманды = Неопределено;
		Если Параметры.Отбор.Свойство("ПараметрКоманды", ПараметрКоманды) Тогда
			Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Статусы") Тогда
				УстановитьОтборДинамическогоСписка("ЗадачаРеестра.СтатусЗадачи", ПараметрКоманды);
			ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Действия") Тогда
				УстановитьОтборДинамическогоСписка("Действие", ПараметрКоманды);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборДинамическогоСписка(ЛевоеЗначение, Значение)
	
	Список.Отбор.Элементы.Очистить();
	
	Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных(ЛевоеЗначение);
	Отбор.ПравоеЗначение   = Значение;
	Отбор.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	Отбор.Использование    = Истина;
	
КонецПроцедуры

#КонецОбласти
