
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если ЗначениеЗаполнено(Запись.Задача) И Запись.Описано Тогда
			ЗадачаОбъект = Запись.Задача.ПолучитьОбъект();
			Если НЕ ЗадачаОбъект.НаличиеИнструкций = Перечисления.НаличиеСвойства.Есть Тогда
				ЗадачаОбъект.НаличиеИнструкций = Перечисления.НаличиеСвойства.Есть;
				ЗадачаОбъект.ОбменДанными.Загрузка = Истина;
				ЗадачаОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
