
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РеестрФункцийСервер.РегистрацияСобытия("Функции.Список");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)

	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("МассивОбъектов", Элементы.Список.ВыделенныеСтроки);
	НачатьИзменениеВыделенных(ПараметрыКоманды);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СлужебныеПроцедурыИФункцииКлиент

&НаКлиенте
Процедура НачатьИзменениеВыделенных(ПараметрыГрупповогоИзменения)

	Если Не ПараметрыГрупповогоИзменения.МассивОбъектов.Количество() Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'Команда не может быть выполнена для указанного объекта.'"));
	Иначе
		ОткрытьФорму("Обработка.ГрупповоеИзменениеРеквизитов.Форма", ПараметрыГрупповогоИзменения);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииСервер

#КонецОбласти

#КонецОбласти
