
#Область ПрограммныйИнтерфейс

// Справочники перед записью.
// 
// Параметры:
//  Источник - СправочникОбъект.Функции, СправочникОбъект.Действия, СправочникОбъект.ОбъектыФункций, СправочникОбъект.ЗадачиУчетныхСистем, СправочникОбъект.Проекты, СправочникОбъект.Пользователи, СправочникОбъект.Статусы - Источник.
//  Отказ - Булево - Отказ.
Процедура СправочникиПередЗаписью(Источник, Отказ) Экспорт
	
	Если Источник.ЭтоГруппа И НЕ ТипЗнч(Источник) = Тип("СправочникОбъект.Функции") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.Пользователи") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Источник.ОбменДанными.Загрузка И Источник.Автор.Пустая() Тогда
		Источник.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Источник.ДатаИзменения = ТекущаяДатаСеанса();
	
	Если НЕ ЗначениеЗаполнено(Источник.ДатаСоздания) Тогда
		Источник.ДатаСоздания = Источник.ДатаИзменения;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти