///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
//////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Производит инициализацию элементов справочника
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОбъектыФункций.Ссылка КАК Ссылка,
		|	ОбъектыФункций.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ОбъектыФункций КАК ОбъектыФункций
		|ГДЕ
		|	НЕ ОбъектыФункций.ПометкаУдаления
		|	И ОбъектыФункций.ЭтоГруппа";
	Выборка = Запрос.Выполнить().Выбрать();
	
	ИспользованныеСокращения = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		СокращениеСтрока = "";
		СокращениеМассив = СтрРазделить(Выборка.Наименование, " -");
		Если СокращениеМассив.Количество() = 1 Тогда
			СокращениеСтрока = Лев(СокращениеМассив[0], 3);
		Иначе
			Для Каждого Сокращение Из СокращениеМассив Цикл
				СокращениеСтрока = СтрШаблон("%1%2", СокращениеСтрока, Лев(Сокращение, 1));
			КонецЦикла;
		КонецЕсли;
		
		Если НЕ ИспользованныеСокращения.Найти(СокращениеСтрока) = Неопределено Тогда
			СокращениеСтрока = СтрШаблон("%1%2", СокращениеСтрока, Сред(Сокращение, 2, 1));
		КонецЕсли;
		ИспользованныеСокращения.Добавить(СокращениеСтрока);
		
		ОбъектФункций = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектФункций.Сокращение = ВРег(СокращениеСтрока);
		ОбъектФункций.Записать();
		
	КонецЦикла;
	
КонецПроцедуры // ВыполнитьНачальноеЗаполнение()

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Родитель");
	Поля.Добавить("Наименование");
	Поля.Добавить("ТиповойОбъект");
	Поля.Добавить("ЭтоГруппа");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Данные.ЭтоГруппа Тогда
		Представление = Данные.Наименование; // Строка
	Иначе
		Представление = СтрШаблон("%2 (%3)%1",
			 Формат(Данные.ТиповойОбъект, "БЛ=; БИ=' [Tиповой]';"),
			 Данные.Наименование,
			 Данные.Родитель);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПараметрыОбработкиРеквизитовОбъекта

Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура;
	УникальныеРеквизиты.Вставить("Код");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

#КонецОбласти

#КонецОбласти

#КонецЕсли
