

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	Если ЗначениеЗаполнено(Проект) Тогда
		Префикс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Проект, "Код");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЭтоГруппа И НЕ ЗначениеЗаполнено(Проект) Тогда
		Проект = Константы.ПроектПоУмолчанию.Получить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		
		Если НЕ ЗначениеЗаполнено(Родитель) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Объекты можно добавлять только в каталоги объектов";
			Сообщение.Сообщить();
			Отказ = Истина
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
