
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗагрузкаВыполнена0 = Истина;
	
	Проект = Константы.ПроектПоУмолчанию.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РежимЗагрузкиПриИзменении();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если НЕ ЗначениеЗаполнено(РежимЗагрузки) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не указан режим загрузки";
		Сообщение.ПутьКДанным = "РежимЗагрузки";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если РежимЗагрузки = 1 Тогда
		Если ЗагрузитьНаСервере(РежимЗагрузки, РежимЗагрузки1_ТекстовыйДокумент, Проект) Тогда
			ЗагрузкаВыполнена1 = Истина;
			РежимЗагрузкиПриИзменении();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКСледующемуШагу(Команда)
	
	РежимЗагрузки = РежимЗагрузки + 1;
	
	Элементы.ФормаПерейтиКСледующемуШагу.Видимость = (РежимЗагрузки < 1);
	Элементы.ФормаПерейтиКПредыдущемуШагу.Видимость = (РежимЗагрузки > 0);
	
	РежимЗагрузкиПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКПредыдущемуШагу(Команда)
	
	РежимЗагрузки = РежимЗагрузки - 1;
	
	Элементы.ФормаПерейтиКСледующемуШагу.Видимость = (РежимЗагрузки < 1);
	Элементы.ФормаПерейтиКПредыдущемуШагу.Видимость = (РежимЗагрузки > 0);
	
	РежимЗагрузкиПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимЗагрузкиПриИзменении()
	
	Если РежимЗагрузки = 0 Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.ПустаяСтраница;
		Элементы.ФормаПерейтиКСледующемуШагу.КнопкаПоУмолчанию = Истина;
	ИначеЕсли РежимЗагрузки = 1 Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.РежимЗагрузки1;
		Элементы.ФормаЗагрузить1.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
	Для Счет = 0 По 1 Цикл
		Элементы["ПрогрессБарПройденНадписьСтатуса" + Счет].ЦветТекста = Новый Цвет;
		Если ЭтотОбъект["ЗагрузкаВыполнена" + Счет] Тогда
			Элементы["ПрогрессБарПройденКартинкаСтатуса" + Счет].Картинка = БиблиотекаКартинок.ОформлениеКругЗаполненный;
		Иначе
			Элементы["ПрогрессБарПройденКартинкаСтатуса" + Счет].Картинка = БиблиотекаКартинок.ОформлениеКругПустой;
		КонецЕсли;
	КонецЦикла;
	
	Элементы["ПрогрессБарПройденНадписьСтатуса" + РежимЗагрузки].ЦветТекста = Новый Цвет(223, 128, 35);
	
КонецПроцедуры

&НаКлиенте
Процедура СкачатьВнешнююОбработку(Команда)
	
	#Если ВебКлиент Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Скачивание внешней обработки недоступно в веб-клиенте'");
		Сообщение.Сообщить();
		Возврат;
		
	#КонецЕсли
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбораФайла.Заголовок = НСтр("ru = 'Выберите каталог для сохранения файла'");
	ДиалогВыбораФайла.ПолноеИмяФайла = НСтр("ru = 'Получить список метаданных для загрузки в реестр функций.epf'");
	ДиалогВыбораФайла.Фильтр = "Внешняя обработка 1C (*.epf)|*.epf";
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СохранениеФайлаЗавершение", ЭтотОбъект);
	
	ДиалогВыбораФайла.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранениеФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		ПутьКФайлу = СохранениеФайлаЗавершениеНаСервере(ВыбранныеФайлы);
		
		Если ЗначениеЗаполнено(ПутьКФайлу) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Сохранение файла успешно завершено";
			Сообщение.Сообщить();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЗагрузитьНаСервере(РежимЗагрузки, ТекстовыйДокумент, Проект)
	
	Результат = Ложь;
	
	Текст = ТекстовыйДокумент.ПолучитьТекст();
	
	Если ПустаяСтрока(Текст) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Поле ""Текст JSON"" не заполнено";
		Сообщение.Сообщить();
		Возврат Результат;
	КонецЕсли;
	
	Попытка
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Текст);
		
		Результат = ПрочитатьJSON(ЧтениеJSON);
		
		ЧтениеJSON.Закрыть();
		
	Исключение
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не удалось прочитать текст из поля ""Текст JSON"" по причине: " + ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат Результат;
		
	КонецПопытки;
	
	Если РежимЗагрузки = 1 Тогда
		ЗагрузитьОбъекты(Результат, Проект);
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗагрузитьОбъекты(Результат, Знач Проект)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОбъектыФункций.Наименование КАК Имя,
		|	ОбъектыФункций.СинонимОбъекта КАК Синоним,
		|	ОбъектыФункций.ТиповойОбъект КАК Типовой,
		|	ОбъектыФункций.Родитель.Наименование КАК Родитель
		|ИЗ
		|	Справочник.ОбъектыФункций КАК ОбъектыФункций
		|ГДЕ
		|	НЕ ОбъектыФункций.ПометкаУдаления
		|	И НЕ ОбъектыФункций.ЭтоГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОбъектыФункций.Ссылка КАК Ссылка,
		|	ОбъектыФункций.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ОбъектыФункций КАК ОбъектыФункций
		|ГДЕ
		|	НЕ ОбъектыФункций.ПометкаУдаления
		|	И ОбъектыФункций.ЭтоГруппа";
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаЭлементов = РезультатЗапроса[0].Выбрать();
	ВыборкаРодителей = РезультатЗапроса[1].Выбрать();
	
	Объекты_Созданные = Новый Соответствие;
	
	Для Каждого ОбъектДанных Из Результат Цикл
		
		ВыборкаЭлементов.Сбросить();
		
		Попытка
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Имя",       ОбъектДанных.Имя);
			СтруктураПоиска.Вставить("Синоним",   ОбъектДанных.Синоним);
			СтруктураПоиска.Вставить("Типовой",   ОбъектДанных.Типовой);
			СтруктураПоиска.Вставить("Родитель",  ОбъектДанных.Родитель);
			КлючДляПоиска = СтрШаблон("%1%2%3%4", ОбъектДанных.Имя, ОбъектДанных.Синоним, ОбъектДанных.Типовой, ОбъектДанных.Родитель);
		Исключение
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = ОписаниеОшибки();
			Сообщение.Сообщить();
			Продолжить;
		КонецПопытки;
		
		Если ВыборкаЭлементов.НайтиСледующий(СтруктураПоиска) Тогда
			Продолжить;
		Иначе
			НовыйОбъект = Объекты_Созданные.Получить(КлючДляПоиска);
			Если НовыйОбъект = Неопределено Тогда
				Попытка
					ВыборкаРодителей.Сбросить();
					Если ВыборкаРодителей.НайтиСледующий(ОбъектДанных.Родитель, "Наименование") Тогда
						Родитель = ВыборкаРодителей.Ссылка;
					Иначе
						Сообщение = Новый СообщениеПользователю();
						Сообщение.Текст = СтрШаблон("Не удалось найти родителя с наименованием ""%1""", ОбъектДанных.Родитель);
						Сообщение.Сообщить();
						Продолжить;
					КонецЕсли;
					
					НовыйОбъект = Справочники.ОбъектыФункций.СоздатьЭлемент();
					НовыйОбъект.Наименование   = ОбъектДанных.Имя;
					НовыйОбъект.СинонимОбъекта = ОбъектДанных.Синоним;
					НовыйОбъект.ТиповойОбъект  = ОбъектДанных.Типовой;
					НовыйОбъект.Родитель       = Родитель;
					НовыйОбъект.Комментарий    = "Добавлен автоматически при загрузке объектов";
					НовыйОбъект.Проект         = Проект;
					НовыйОбъект.Записать();
					Объекты_Созданные.Вставить(КлючДляПоиска, НовыйОбъект);
				Исключение
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "Не удалось записать объект " + ОбъектДанных.Имя + " (" + ОбъектДанных.Синоним + ") "
						+ " по причине: " + ОписаниеОшибки();
					Сообщение.Сообщить();
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = "Загрузка завершена";
	Сообщение.Сообщить();
	
	РеестрФункцийСервер.РегистрацияСобытия("ЗагрузкаОбъектов.ЗагрузитьОбъекты");
	
КонецПроцедуры

// Сохранение файла завершение на сервере.
// 
// Параметры:
//  ВыбранныеФайлы - Массив из Строка -  Выбранные файлы
//  ИмяФайла - Строка -  Имя файла
//  Описание - Строка -  Описание
// 
// Возвращаемое значение:
//  Неопределено, Произвольный -  Сохранение файла завершение на сервере
&НаСервере
Функция СохранениеФайлаЗавершениеНаСервере(Знач ВыбранныеФайлы)
	
	Макет = Обработки.ЗагрузкаОбъектов.ПолучитьМакет("ПолучитьСписокМетаданныхДляЗагрузкиВРеестрФункций");
	
	Если НЕ Макет = Неопределено Тогда
		Макет.Записать(ВыбранныеФайлы[0]);
	КонецЕсли;
	
	Возврат ВыбранныеФайлы[0];
	
КонецФункции

&НаКлиенте
Процедура Декорация1ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "СкачатьВнешнююОбработку" Тогда
		СкачатьВнешнююОбработку(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
