
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РеестрФункцийСервер.РегистрацияСобытия("Инструкции.Элемент");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РазвернутьДеревоНаКлиенте();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОбновитьДеревоНаСервере();
	
	ЭлементыДерева = ДеревоЗадачИФункций.ПолучитьЭлементы();
	Для Каждого Родитель Из ЭлементыДерева Цикл
		Родитель.Описано = УстановитьЗначениеФлажкаРодителя(Родитель.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьЗадачиИФункции(ТекущийОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КодНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПодключитьОбработчикОжидания("Подключаемый_КодНачалоВыбора", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыДеревоЗадачиИФункций

&НаКлиенте
Процедура ДеревоЗадачИФункцийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Проект", Объект.Проект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	// Описание оповещения
	ОписаниеОповещения = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", ЭтотОбъект, "ДобавлениеЗадачи");
	
	ОткрытьФорму(
		"Справочник.ЗадачиУчетныхСистем.ФормаВыбора",
		ПараметрыФормы,
		ЭтотОбъект, , , ,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗадачИФункцийПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ДеревоЗадачИФункций.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Идентификатор = ТекущиеДанные.ПолучитьИдентификатор();
	Родитель = ДеревоЗадачИФункций.НайтиПоИдентификатору(Идентификатор).ПолучитьРодителя();
	
	Если НЕ Родитель = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоЗадачИФункций

&НаКлиенте
Процедура ДеревоЗадачИФункцийОписаноПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоЗадачИФункций.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Описано = 2 Тогда
		ТекущиеДанные.Описано = 0;
	КонецЕсли;
	
	Идентификатор = ТекущиеДанные.ПолучитьИдентификатор();
	ЭлементыДерева = ДеревоЗадачИФункций.НайтиПоИдентификатору(Идентификатор).ПолучитьЭлементы();
	Если ТекущиеДанные.Описано = 1 Тогда
		УстановитьСнятьФлажкиРекурсивно(ЭлементыДерева);
	Иначе
		УстановитьСнятьФлажкиРекурсивно(ЭлементыДерева, 0);
	КонецЕсли;
	
	Родитель = ТекущиеДанные.ПолучитьРодителя();
	Пока Не Родитель = Неопределено Цикл
		Родитель.Описано = УстановитьЗначениеФлажкаРодителя(Родитель.ПолучитьИдентификатор());
		Родитель = Родитель.ПолучитьРодителя();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СвернутьДерево(Команда)
	
	ЭлементыКорняДерева = ДеревоЗадачИФункций.ПолучитьЭлементы();
	Для Каждого ЭлементКорняДерева Из ЭлементыКорняДерева Цикл
		Элементы.ДеревоЗадачИФункций.Свернуть(ЭлементКорняДерева.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДерево(Команда)
	
	РазвернутьДеревоНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСлужебногоПрограммногоИнтерфейса

&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ДополнительныеПараметры = "ДобавлениеЗадачи" Тогда
		
		Если ЗначениеЗаполнено(РезультатОповещения) Тогда
			
			ЭлементыДерева = ДеревоЗадачИФункций.ПолучитьЭлементы();
			
			Для Каждого Строка Из ЭлементыДерева Цикл
				Если Строка.ЗадачаИФункция = РезультатОповещения Тогда
					Возврат;
				КонецЕсли;
			КонецЦикла;
			
			НоваяСтрока = ЭлементыДерева.Добавить();
			НоваяСтрока.ЗадачаИФункция = РезультатОповещения;
			
			Идентификатор = НоваяСтрока.ПолучитьИдентификатор();
			
			ДобавитьЗадачуНаСервере(Идентификатор, РезультатОповещения);
			
			Элементы.ДеревоЗадачИФункций.Развернуть(Идентификатор, Истина);
			
			Модифицированность = Истина;
			
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КодНачалоВыбора() Экспорт
	
	КодНачалоВыбораНаСервере();
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииКлиент

// Отключены некоторые проверки
//@skip-check property-return-type
//@skip-check dynamic-access-method-not-found
&НаКлиенте
Процедура УстановитьСнятьФлажкиРекурсивно(ЭлементыУровняДерева, ЗначениеФлажка = 1, МассивДляУстановки = Неопределено, МассивДляСнятия = Неопределено)
	
	Для Каждого ЭлементУровняДерева Из ЭлементыУровняДерева Цикл
		
		Если ЗначениеФлажка = 1 И НЕ МассивДляУстановки = Неопределено Тогда
			Если НЕ МассивДляУстановки.Найти(ЭлементУровняДерева.ОтборЭлемент) = Неопределено Тогда
				ЭлементУровняДерева.Описано = 1;
			КонецЕсли;
		ИначеЕсли ЗначениеФлажка = 0 И НЕ МассивДляСнятия = Неопределено Тогда
			Если НЕ МассивДляСнятия.Найти(ЭлементУровняДерева.ОтборЭлемент) = Неопределено Тогда
				ЭлементУровняДерева.Описано = 0;
			КонецЕсли;
		Иначе
			ЭлементУровняДерева.Описано = ЗначениеФлажка;
		КонецЕсли;
		
		УстановитьСнятьФлажкиРекурсивно(ЭлементУровняДерева.ПолучитьЭлементы(), ЗначениеФлажка, МассивДляУстановки, МассивДляСнятия);
		
		Родитель = ЭлементУровняДерева.ПолучитьРодителя();
		Пока Не Родитель = Неопределено Цикл
			Родитель.Описано = УстановитьЗначениеФлажкаРодителя(Родитель.ПолучитьИдентификатор());
			Родитель = Родитель.ПолучитьРодителя();
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция УстановитьЗначениеФлажкаРодителя(ИдентификаторСтроки)
	
	Родитель = ДеревоЗадачИФункций.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	ВПодчиненныхЕстьИстина = НайтиЗначениеФлажкаРодителяРекурсивно(Родитель.ПолучитьЭлементы(), 1);
	ВПодчиненныхЕстьЛожь   = НайтиЗначениеФлажкаРодителяРекурсивно(Родитель.ПолучитьЭлементы());
	
	Если ВПодчиненныхЕстьИстина И ВПодчиненныхЕстьЛожь Тогда
		Результат = 2;
	ИначеЕсли ВПодчиненныхЕстьИстина Тогда
		Результат = 1;
	Иначе
		Результат = 0;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Отключены некоторые проверки
//@skip-check property-return-type
&НаСервере
Функция НайтиЗначениеФлажкаРодителяРекурсивно(ЭлементыДерева, Значение = 0)
	
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		Если ЭлементДерева.Описано = Значение
			Или НайтиЗначениеФлажкаРодителяРекурсивно(ЭлементДерева.ПолучитьЭлементы(), Значение) Тогда
				Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура РазвернутьДеревоНаКлиенте()
	
	ЭлементыКорняДерева = ДеревоЗадачИФункций.ПолучитьЭлементы();
	Для Каждого ЭлементКорняДерева Из ЭлементыКорняДерева Цикл
		Элементы.ДеревоЗадачИФункций.Развернуть(ЭлементКорняДерева.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииСервер

&НаСервере
Процедура ОбновитьДеревоНаСервере()
	
	ДеревоЗадачИФункцийЭлементы = ДеревоЗадачИФункций.ПолучитьЭлементы();
	ДеревоЗадачИФункцийЭлементы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Инструкции.Задача КАК Задача,
		|	Инструкции.Функция КАК Функция,
		|	Инструкции.Описано КАК Описано
		|ПОМЕСТИТЬ втИнструкции
		|ИЗ
		|	РегистрСведений.Инструкции КАК Инструкции
		|ГДЕ
		|	Инструкции.Инструкция = &Инструкция
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Задача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеестрФункций.ЗадачаРеестра КАК Задача,
		|	РеестрФункций.ФункцияРеестра КАК Функция
		|ПОМЕСТИТЬ втЗадачи
		|ИЗ
		|	РегистрСведений.РеестрФункций КАК РеестрФункций
		|ГДЕ
		|	РеестрФункций.ЗадачаРеестра В
		|			(ВЫБРАТЬ
		|				втИнструкции.Задача КАК Задача
		|			ИЗ
		|				втИнструкции КАК втИнструкции)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втИнструкции.Задача КАК Задача,
		|	втИнструкции.Функция КАК Функция,
		|	втИнструкции.Описано КАК Описано
		|ПОМЕСТИТЬ втИтоговая
		|ИЗ
		|	втИнструкции КАК втИнструкции
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втЗадачи.Задача,
		|	втЗадачи.Функция,
		|	ЛОЖЬ
		|ИЗ
		|	втЗадачи КАК втЗадачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втИтоговая.Задача КАК Задача,
		|	втИтоговая.Функция КАК Функция,
		|	МАКСИМУМ(втИтоговая.Описано) КАК Описано
		|ИЗ
		|	втИтоговая КАК втИтоговая
		|ГДЕ
		|	НЕ втИтоговая.Функция = ЗНАЧЕНИЕ(Справочник.Функции.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	втИтоговая.Задача,
		|	втИтоговая.Функция
		|
		|УПОРЯДОЧИТЬ ПО
		|	втИтоговая.Задача.Код,
		|	втИтоговая.Функция.Наименование
		|ИТОГИ ПО
		|	Задача";
	Запрос.УстановитьПараметр("Инструкция", Объект.Ссылка);
	
	ВыборкаЗадача = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЗадача.Следующий() Цикл
		
		ЭлементРодитель = ДеревоЗадачИФункцийЭлементы.Добавить();
		ЭлементРодитель.ЗадачаИФункция = ВыборкаЗадача.Задача;
		ЭлементРодительЭлементы = ЭлементРодитель.ПолучитьЭлементы();
		
		Выборка = ВыборкаЗадача.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ЭлементРодительЭлементы = ЭлементРодитель.ПолучитьЭлементы();
			НовыйЭлементДерева = ЭлементРодительЭлементы.Добавить();
			НовыйЭлементДерева.ЗадачаИФункция = Выборка.Функция;
			НовыйЭлементДерева.Описано = Выборка.Описано;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗадачиИФункции(ТекущийОбъект)
	
	НаборЗаписей = РегистрыСведений.Инструкции.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Инструкция.Установить(ТекущийОбъект.Ссылка);
	
	ЭлементыДерева = ДеревоЗадачИФункций.ПолучитьЭлементы();
	Для Каждого Родитель Из ЭлементыДерева Цикл
		
		ФункцииЗадачи = Родитель.ПолучитьЭлементы();
		Для Каждого ФункцияЗадачи Из ФункцииЗадачи Цикл
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Задача     = Родитель.ЗадачаИФункция;
			НоваяЗапись.Функция    = ФункцияЗадачи.ЗадачаИФункция;
			НоваяЗапись.Инструкция = ТекущийОбъект.Ссылка;
			НоваяЗапись.Описано    = ФункцияЗадачи.Описано;
			
		КонецЦикла;
		
		Попытка
			ЗадачаОбъект = Родитель.ЗадачаИФункция.ПолучитьОбъект();
			Если НЕ ЗадачаОбъект.НаличиеИнструкций = Перечисления.НаличиеСвойства.Есть Тогда
				ЗадачаОбъект.НаличиеИнструкций = Перечисления.НаличиеСвойства.Есть;
				ЗадачаОбъект.ОбменДанными.Загрузка = Истина;
			КонецЕсли;
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось обновить информацию об инструкциях в задаче [%1] по причине: %2'"), Родитель.ЗадачаИФункция, ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗадачуНаСервере(ИдентификаторСтроки, Задача)
	
	СтрокаДерева = ДеревоЗадачИФункций.НайтиПоИдентификатору(ИдентификаторСтроки).ПолучитьЭлементы();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеестрФункций.ФункцияРеестра КАК Функция
		|ИЗ
		|	РегистрСведений.РеестрФункций КАК РеестрФункций
		|ГДЕ
		|	РеестрФункций.ЗадачаРеестра = &Задача
		|
		|СГРУППИРОВАТЬ ПО
		|	РеестрФункций.ФункцияРеестра";
	Запрос.УстановитьПараметр("Задача", Задача);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаДерева.Добавить().ЗадачаИФункция = Выборка.Функция;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура КодНачалоВыбораНаСервере()
	
	ОбъектИнструкция = РеквизитФормыВЗначение("Объект");
	ОбъектИнструкция.УстановитьНовыйКод();
	Объект.Код = СокрЛП(ОбъектИнструкция.Код);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
