
#Область ПрограммныйИнтерфейс

Процедура ПроверитьЗаполнениеРеквизитовОбъекта(Объект, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	// Подготовим список проверяемых реквизитов к заполнению
	ПроверяемыеРеквизиты.Очистить();
	
	// Получим параметры текущего проверяемого объекта
	ОбъектМетаданных    = Объект.Метаданные();
	МенеджерОбъекта     = МенеджерОбъектаПоПолномуИмени(ОбъектМетаданных.ПолноеИмя());
	ЭтоСправочник       = Метаданные.Справочники.Содержит(ОбъектМетаданных);
	Владелец            = ?(ЭтоСправочник И ЗначениеЗаполнено(Объект.Владелец), Объект.Владелец, Неопределено);
	ПредставлениеСписка = "";
	
	// Произведем проверку уникальности заполнения реквизитов объекта
	Для каждого УникальныйРеквизит Из МенеджерОбъекта.ПолучитьУникальныеРеквизиты(Объект) Цикл
		
		// Обработаем в зависимости от вида реквизита
		Если ТипЗнч(УникальныйРеквизит.Значение) = Тип("Массив") Тогда
			
			// В данной версии программы не поддерживается контроль уникальности объектов на уровне полей табличных частей.
			
		Иначе
			
			// Формируем текст запроса для поиска имеющейся записи таблицы
			ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	*
			|ИЗ
			|	" + ОбъектМетаданных.ПолноеИмя() + " КАК Таблица
			|ГДЕ
			|	Таблица.Ссылка <> &Ссылка
			|	И (НЕ Таблица.ПометкаУдаления)";
			
			// Создаем объект запроса и устанавливаем параметры
			Запрос = Новый ПостроительЗапроса(ТекстЗапроса);
			Запрос.ЗаполнитьНастройки();
			Запрос.Параметры.Вставить("Ссылка", Объект.Ссылка);
			
			Запрос.ВыбранныеПоля.Очистить();
			Запрос.ВыбранныеПоля.Добавить("Ссылка");
			
			// Накладываем отбор по реквизиту, уникальность которого требуется проверить
			ЭлементОтбора = Запрос.Отбор.Добавить(УникальныйРеквизит.Ключ);
			ЭлементОтбора.Установить(Объект[УникальныйРеквизит.Ключ], Истина);
			
			// Накладываем дополнительный отбор по владельцу для подчиненных справочников
			Если ЭтоСправочник И ЗначениеЗаполнено(Владелец) Тогда
				ЭлементОтбора = Запрос.Отбор.Добавить("Владелец");
				ЭлементОтбора.Установить(Владелец, Истина);
			КонецЕсли;
			
			// Выполняем запрос
			Запрос.Выполнить();
			
			// Выводим сообщение о не уникальности объекта среди своего списка
			Если НЕ Запрос.Результат.Пустой() Тогда
				
				// Получим представление списка объектов
				Если ПустаяСтрока(ПредставлениеСписка) Тогда
					ПредставлениеСписка = ПредставлениеСпискаОбъектов(ОбъектМетаданных);
				КонецЕсли;
				
				// Получим описание метаданных проверяемого реквизита
				ОбъектМетаданныхРеквизита = ОбъектМетаданных.Реквизиты.Найти(УникальныйРеквизит.Ключ);
				Если ОбъектМетаданныхРеквизита = Неопределено Тогда
					ОбъектМетаданныхРеквизита = Метаданные.ОбщиеРеквизиты.Найти(УникальныйРеквизит.Ключ);
				КонецЕсли;
				
				// Проверим уникальные реквизиты для стандартных реквизитов объекта
				Если ОбъектМетаданныхРеквизита = Неопределено Тогда
					Для каждого СтандартныйРеквизит Из ОбъектМетаданных.СтандартныеРеквизиты Цикл
						Если СтандартныйРеквизит.Имя = УникальныйРеквизит.Ключ Тогда
							ОбъектМетаданныхРеквизита = СтандартныйРеквизит;
							Продолжить;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				// Информируем пользователя о найденной коллизии
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон(НСтр("ru = 'Поле ""%1"" не уникально в пределах ""%2""'"),
					ОбъектМетаданныхРеквизита.Представление(),
					ПредставлениеСписка);
				Сообщение.Поле = Объект[УникальныйРеквизит.Ключ];
				Сообщение.Сообщить();
				
				Отказ = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ПроверитьЗаполнениеРеквизитовОбъекта()

// Возвращает менеджер объекта по полному имени объекта метаданных.
// Ограничение: не обрабатываются точки маршрутов бизнес-процессов.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных. Пример: "Справочник.Организации".
//
// Возвращаемое значение:
//  СправочникМенеджер, ДокументМенеджер, ОбработкаМенеджер, РегистрСведенийМенеджер - менеджер объекта.
// 
// Пример:
//  МенеджерСправочника = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Справочник.Организации");
//  ПустаяСсылка = МенеджерСправочника.ПустаяСсылка();
//
Функция МенеджерОбъектаПоПолномуИмени(ПолноеИмя) Экспорт
	
	Перем КлассОМ, ИмяОМ, Менеджер;
	
	ЧастиИмени = СтрРазделить(ПолноеИмя, ".");
	
	Если ЧастиИмени.Количество() >= 2 Тогда
		КлассОМ = ЧастиИмени[0];
		ИмяОМ   = ЧастиИмени[1];
	Иначе 
		Менеджер = Неопределено;
	КонецЕсли;
	
	Если      ВРег(КлассОМ) = "ПЛАНОБМЕНА" Тогда
		Менеджер = ПланыОбмена;
		
	ИначеЕсли ВРег(КлассОМ) = "СПРАВОЧНИК" Тогда
		Менеджер = Справочники;
		
	ИначеЕсли ВРег(КлассОМ) = "ДОКУМЕНТ" Тогда
		Менеджер = Документы;
		
	ИначеЕсли ВРег(КлассОМ) = "ЖУРНАЛДОКУМЕНТОВ" Тогда
		Менеджер = ЖурналыДокументов;
		
	ИначеЕсли ВРег(КлассОМ) = "ПЕРЕЧИСЛЕНИЕ" Тогда
		Менеджер = Перечисления;
		
	ИначеЕсли ВРег(КлассОМ) = "ОТЧЕТ" Тогда
		Менеджер = Отчеты;
		
	ИначеЕсли ВРег(КлассОМ) = "ОБРАБОТКА" Тогда
		Менеджер = Обработки;
		
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНВИДОВХАРАКТЕРИСТИК" Тогда
		Менеджер = ПланыВидовХарактеристик;
		
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНСЧЕТОВ" Тогда
		Менеджер = ПланыСчетов;
		
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНВИДОВРАСЧЕТА" Тогда
		Менеджер = ПланыВидовРасчета;
		
	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРСВЕДЕНИЙ" Тогда
		Менеджер = РегистрыСведений;
		
	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРНАКОПЛЕНИЯ" Тогда
		Менеджер = РегистрыНакопления;
		
	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРБУХГАЛТЕРИИ" Тогда
		Менеджер = РегистрыБухгалтерии;
		
	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРРАСЧЕТА" Тогда
		
		Если      ЧастиИмени.Количество() = 2 Тогда
			Менеджер = РегистрыРасчета;
			
		ИначеЕсли ЧастиИмени.Количество() = 4 Тогда
			КлассПодчиненногоОМ = ЧастиИмени[2];
			ИмяПодчиненногоОМ = ЧастиИмени[3];
			
			Если ВРег(КлассПодчиненногоОМ) = "ПЕРЕРАСЧЕТ" Тогда 
				Менеджер = РегистрыРасчета[ИмяОМ].Перерасчеты;
				ИмяОм = ИмяПодчиненногоОМ;
				
			Иначе 
				Менеджер = Неопределено;
			КонецЕсли;
			
		Иначе
			Менеджер = Неопределено;
		КонецЕсли;
		
	ИначеЕсли ВРег(КлассОМ) = "БИЗНЕСПРОЦЕСС" Тогда
		Менеджер = БизнесПроцессы;
		
	ИначеЕсли ВРег(КлассОМ) = "ЗАДАЧА" Тогда
		Менеджер = Задачи;
		
	ИначеЕсли ВРег(КлассОМ) = "КОНСТАНТА" Тогда
		Менеджер = Константы;
		
	ИначеЕсли ВРег(КлассОМ) = "ПОСЛЕДОВАТЕЛЬНОСТЬ" Тогда
		Менеджер = Последовательности;
		
	Иначе
		Менеджер = Неопределено;
	КонецЕсли;
	
	Если Менеджер = Неопределено Тогда
		ПроверитьОбъектМетаданныхСуществует(ПолноеИмя);
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Объект метаданных ""%1"" не имеет менеджера объекта.'"), ПолноеИмя);
	КонецЕсли;
	
	Попытка
		Возврат Менеджер[ИмяОМ];
	Исключение
		ПроверитьОбъектМетаданныхСуществует(ПолноеИмя);
		ВызватьИсключение;
	КонецПопытки;
	
КонецФункции

// Функция возвращает расширенное представление списка для переданного объекта.
//
// Параметры:
//  Объект - УправляемаяФорма, ОбъектМетаданных, Ссылка - искомый объект.
//
// Возвращаемое значение:
//  Структура - представление объекта.
//
Функция ПредставлениеСпискаОбъектов(Объект) Экспорт
	
	// Получим метаданные переданного объекта
	Если ТипЗнч(Объект) = Тип("ФормаКлиентскогоПриложения") Тогда
		ОбъектМетаданных = ПолучитьМетаданныеОбъектаФормы(Объект);
	ИначеЕсли ТипЗнч(Объект) = Тип("ОбъектМетаданных") Тогда
		ОбъектМетаданных = Объект;
	Иначе
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(Объект));
	КонецЕсли;
	
	// Некоторые свойства представления могут не существовать для объектов данного типа.
	Представления = Новый Структура("РасширенноеПредставлениеСписка,ПредставлениеСписка", Неопределено, Неопределено);
	ЗаполнитьЗначенияСвойств(Представления, ОбъектМетаданных);
	
	// Проверим какое из свойств представления заполнено
	Если НЕ ПустаяСтрока(Представления.РасширенноеПредставлениеСписка) Тогда
		Возврат Представления.РасширенноеПредставлениеСписка;
		
	ИначеЕсли НЕ ПустаяСтрока(Представления.ПредставлениеСписка) Тогда
		Возврат Представления.ПредставлениеСписка;
		
	Иначе
		Возврат ОбъектМетаданных.Представление();
	КонецЕсли;
	
КонецФункции // ПредставлениеСпискаОбъектов()

// Возвращает метаданные объекта, которому принадлежит переданная форма.
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, для которой производиться получение объекта описания метаданных.
// 
// Возвращаемое значение:
//  ОбъектМетаданных - Найденный объект.
//
Функция ПолучитьМетаданныеОбъектаФормы(Форма) Экспорт
	
	// Определим имя формы
	ИмяФормы = ?(ТипЗнч(Форма) = Тип("Строка"), Форма, Форма.ИмяФормы);
	
	// Произведем разложение переданного имени на составляющие
	ЭлементыИмениОбъекта = СтрРазделить(ИмяФормы, ".", Ложь);
	
	// Формируем полное имя объекта метаданных
	ПолноеИмя = ЭлементыИмениОбъекта[0] + "." + ЭлементыИмениОбъекта[1];
	
	// Получаем объект описания метаданных по переданному имени
	Возврат Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
	
КонецФункции // ПолучитьМетаданныеОбъектаФормы()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьОбъектМетаданныхСуществует(ПолноеИмя)
	
	Если Метаданные.НайтиПоПолномуИмени(ПолноеИмя) = Неопределено Тогда 
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неизвестный тип объекта метаданных ""%1"".'"), ПолноеИмя);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
