
#Область ОбработчикиСобытийФормы

// При создании на сервере.
// 
// Параметры:
//  Отказ - Булево - Отказ
//  СтандартнаяОбработка - Булево - Стандартная обработка
//  Параметры - Структура:
//  * Объект - СправочникСсылка.ОбъектыФункций
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Объект") Тогда
		Запись.Объект = Параметры.Объект;
		Элементы.Объект.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Запись.Период = ТекущаяДатаСеанса();
	Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

#КонецОбласти
